{
  "subjectLine": "\"Market Mayhem: US Crypto Rush, Whales Galore & Bitcoin Breakouts!\"",
  "articles": [
    {
      "original": "https://cryptopanic.com/news/21712583/8-major-crypto-firms-announce-US-expansion-this-year?mtm_campaign=API-OFA",
      "resolved": "https://cointelegraph.com/news/nexo-8-crypto-firms-us-expansion-this-year?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "title": "Crypto Exodus: 8 Big Players Head for US Shores as Regulatory Clarity Looms Large",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div data-v-60373258=\"\"><p>Crypto services platform Nexo shared its plans to reenter the United States market on Monday, marking the eighth major crypto firm to announce such plans since US President Donald Trump took office at the start of the year.</p><p>Firms like Circle, Binance and OKX are banking on favorable regulatory clarity in 2025 to herald their US expansion. Bills like the STABLE Act and the GENIUS Act are advancing in Congress, which, if implemented, will lay the groundwork for swift success.</p><p>Trump and his family are actively involved in some of these planned expansions. Nexo’s recent announcement was backed by Donald Trump Jr., who said, “We see the opportunity for the financial sector and want to ensure we bring that back to the US.”</p><p>Amid concerns of conflicts of interest and blatant token shilling by the Trump family, it remains to be seen whether these upcoming regulations will adequately protect everyday investors. Regardless, these are the eight firms that have banked on big bucks in the US this year.</p><h2>Binance.US resumes USD services; CZ seeks clemency&nbsp;</h2><p>Binance.US officially <a data-ct-non-breakable=\"null\" href=\"https://www.binance.com/en/square/post/17776806459913?utm_source=chatgpt.com\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">reinstated</a> USD deposit and withdrawal services less than a month into Trump’s presidency.&nbsp;</p><p>They were halted on June 13, 2023, on the back of a civil enforcement action by the Commodity Futures Trading Commission (CFTC), claiming willful evasion of US laws and operating illegally in the country. Binance later settled for $2.7 billion; then-CEO Changpeng Zhao paid $150 million.</p><p>Soon after halting USD on- and off-ramps, the Securities and Exchange Commission sued Binance and its then-CEO, Changpeng Zhao, with a lawsuit. The agency <a data-ct-non-breakable=\"null\" href=\"https://archive.ph/MEZZV\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">claimed</a> Zhao and Binance “engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law.”</p><p>In November 2023, Binance and CZ agreed on a settlement with the Department of Justice that included pleading guilty to federal charges, including violating Anti-Money Laundering laws, a $4.3-billion fine, CZ’s dismissal as CEO and a prison sentence.</p><p>Zhao has <a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/changpeng-zhao-cz-binance-asked-trump-pardon\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">sought clemency from President Trump</a>, who has pardoned a number of crypto executives.&nbsp;</p><figure><img alt=\"\" src=\"https://s3.cointelegraph.com/uploads/2025-05/0196ad23-3f9d-7d7b-ab31-c3fbb1d9a1f0\" title=\"\"><figcaption><em>Zhao (right) discusses his clemency request. Source: </em><a data-ct-non-breakable=\"null\" href=\"https://www.youtube.com/watch?v=n1W5VbLFZtw&amp;t=2298s\" rel=\"null\" target=\"null\" text=\"null\" title=\"https://www.youtube.com/watch?v=n1W5VbLFZtw&amp;t=2298s\"><em>Farokh Radio</em></a></figcaption></figure><h2>eToro files for US IPO after 2024 enforcement action</h2><p>Online trading platform eToro publicly <a data-ct-non-breakable=\"null\" href=\"https://www.etoro.com/en-us/news-and-analysis/latest-news/press-release/etoro-announces-public-filing-of-registration-statement-for-proposed-initial-public-offering/?utm_source=chatgpt.com\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">filed</a> its registration statement for a proposed initial public offering (IPO) on the Nasdaq Global Select Market under the ticker symbol “ETOR.” The IPO is anticipated to occur as early as Q2 2025, pending market conditions, with eToro seeking a $4-billion valuation with plans to raise $500 million by offering 10 million Class A shares.&nbsp;</p><p>The trading platform ran into some trouble with the SEC in 2024, when the agency <a data-ct-non-breakable=\"null\" href=\"https://www.sec.gov/newsroom/press-releases/2024-125\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">claimed</a> eToro “operated an unregistered broker and unregistered clearing agency in connection with its trading platform that facilitated buying and selling certain crypto assets as securities.”</p><p>As a result, eToro paid a fine and agreed to reduce its crypto offerings for US customers to Bitcoin <!---->, Bitcoin Cash <!----> and Ether <!---->.</p><p>The move signals growing investor confidence in the future of retail cryptocurrency trading platforms in the US as the jurisdiction reorients its rules defining cryptocurrencies and loosens restrictions that made it more difficult for such platforms to receive banking services.&nbsp;</p><h2>OKX relaunches in the US months after $500-million settlement</h2><p>OKX, a major global cryptocurrency exchange, announced its reentry into the US market in April 2025. The company is implementing a phased rollout plan throughout the year and has established a new regional headquarters in San Jose, California. The firm also <a data-ct-non-breakable=\"null\" href=\"https://fortune.com/crypto/2025/04/15/okx-relaunch-us-exchange-wallet-san-jose-california-new-ceo-roshan-robert/\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">named</a> Roshan Robert, recently of Barclays, as head of its US operations.&nbsp;</p><p><img src=\"https://images.cointelegraph.com/images/373_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9hNGFkNDk1ZmMwNGJkOTdmNzE2NDlhNDhkNjAwM2QwMC5wbmc=.png\"></p><figure data-ct-story-hidden=\"undefined\"><img src=\"https://s3.cointelegraph.com/uploads/2025-05/0196b513-ddb5-76d0-88e6-7005c2f41534\" title=\"\"><figcaption><em>Edit the caption here or remove the text</em></figcaption></figure><p>The relaunch comes just months after the firm announced a settlement with the US Department of Justice (DOJ). US attorneys alleged that the platform “knowingly violated anti-money laundering laws and avoided implementing required policies to prevent criminals from abusing our financial system” for over seven years. </p><p>OKX paid a hefty $500-million fine, pleaded guilty to operating an unlicensed money-transmitting business, and agreed to pay for an external compliance consultant. In a statement, OKX <a data-ct-non-breakable=\"null\" href=\"https://www.okx.com/learn/bringing-okx-to-the-united-states-a-new-era-for-crypto-and-web3-innovation\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">said</a>, “There were no allegations of customer harm, no charges against any Company employee and no government appointed monitor as part of the settlement.</p><p><em><strong>Related: </strong></em><a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/okx-restart-dex-with-anti-abuse-upgrades-after-misuse-by-lazarus\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/okx-restart-dex-with-anti-abuse-upgrades-after-misuse-by-lazarus\"><em><strong>OKX to restart DEX with anti-abuse upgrades after Lazarus ‘misuse’</strong></em></a></p><p>Robert told Fortune that the firm was ramping up its compliance and risk management infrastructures ahead of the relaunch. </p><p>He also cited the improving regulatory landscape as a contributor to the relaunch. “The rulemaking will take some time, but there is a path that we can see,” he said.</p><h2>Nexo returns to US markets after deadlock with regulators</h2><p>Nexo, a global digital assets wealth platform, announced its return to the US market on April 28, 2025, at an event in Sofia, Bulgaria. According to industry media, US customers will have access to Nexo’s asset-backed credit lines, crypto savings accounts and advanced trading options.</p><p>Nexo <a data-ct-non-breakable=\"null\" href=\"https://www.reuters.com/technology/crypto-lender-nexo-quit-united-states-2022-12-05/\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">left</a> the US in 2022 after 18 months of negotiations with federal regulators reached an impasse. Eight different state regulators had charged Nexo with allegedly failing to register its Earn Interest Product.</p><p>Nexo co-founder Antoni Trenchev credited the crypto-friendly approach of President Trump with his firm’s relaunch: “America is back — and so is Nexo.”</p><p>“Nexo is returning to America — stronger, smarter, and determined to win,” he added.</p><h2>Circle relocates to NYC ahead of IPO</h2><p>Circle, the issuer of the USDC (USDC) stablecoin, is relocating its global headquarters from Boston to New York City in early 2025. The move to One World Trade Center aligns with Circle’s plans for an initial public offering and reflects its commitment to integrating with traditional financial markets.&nbsp;</p><p>Circle <a data-ct-non-breakable=\"null\" href=\"https://www.cnbc.com/2025/04/01/usdc-issuer-circle-files-for-ipo-as-public-markets-open-to-crypto.html\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\">filed</a> for its IPO on April 1 and plans to list on the New York Stock Exchange. JPMorgan Chase and Citigroup are serving as lead underwriters. The firm is seeking a $5-billion valuation.&nbsp;</p><p>Circle CEO Jeremy Allaire said, “Our new headquarters near the top of One World Trade Center is a symbol of the trust, security and stability we’re building as a critical infrastructure provider for the future of finance.”</p><p>Circle initially sought to go public via a blank-check firm in 2022, but the deal fell through. The deal would have valued Circle at $9 billion at the time.&nbsp;</p><h2>Crypto.com introduces stock and ETF trading</h2><p>Crypto.com is expanding its services in the US throughout 2025, including introducing trading for stocks and ETFs.&nbsp;</p><p>The company is rolling out these offerings in phases as part of its 2025 roadmap, including significant expansions of its banking, crypto, stock and credit card services for US customers.&nbsp;</p><p>The plan shows the company’s broader strategy of integrating crypto with traditional finance, a theme recurring with many crypto and finance firms operating in the US. </p><p>Travis McGhee, Crypto.com managing director and head of global capital markets, said that the firm is letting clients “marry up that capability [trading stocks and ETFs] with your crypto trading, as well as your crypto derivative trading.”&nbsp;</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/bEsdw7kuadk?start=\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" loading=\"lazy\"></iframe><p>McGhee added that “there’s a lot of tailwinds” pushing the industry ahead, including an “administration that is [...] looking to put a regulatory framework into place.”&nbsp;</p><p>“That just bodes well for a strong market and a strong future for crypto.”</p><h2>a16z returns to US after initial UK move</h2><p>Andreessen Horowitz (a16z) announced that it is closing shop in the UK and focusing its efforts on the US.&nbsp;</p><p>In a Jan. 24 X post, Anthony Albanese, chief operating officer of Andreessen Horowitz’s crypto arm, said the firm will be closing its UK branch despite the “enthusiasm for crypto building and adoption” in the country.</p><p>According to Sifted, the UK government had spent five years wooing a16z to move to London, just for the firm to leave 18 months after it opened its offices there. </p><p><em><strong>Related: </strong></em><a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/miden-raises-25m-to-scale-zk-blockchain-after-polygon-spinout\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/miden-raises-25m-to-scale-zk-blockchain-after-polygon-spinout\"><em><strong>A16z leads $25M funding for Miden blockchain project</strong></em></a></p><p>A16z launched offices in London in 2023, citing the regulatory environment under former President Joe Biden as too unfriendly to the blockchain industry. Albanese said there was “strong momentum” behind the crypto industry with the inauguration of President Trump.</p><p>Per TechCrunch, other factors driving a16z’s relocation were the slow progress on crypto in the UK and the Labour government shifting its priorities away from digital assets.</p><h2>Coinbase acquires Deribit in bid to capture derivatives market</h2><p>US-based crypto exchange Coinbase bought crypto derivatives platform Deribit for $2.9 billion on May 8.&nbsp;</p><p>The merger makes Coinbase the largest crypto derivatives platform by open interest, per an exchange blog post.&nbsp;</p><p>The deal comes as major crypto exchanges like Coinbase, Kraken and Robinhood jockey to dominate the growing global crypto derivative market. On the day of the announcement, Coinbase’s international derivatives exchange saw $10 billion in trading.</p><figure><img alt=\"\" src=\"https://s3.cointelegraph.com/uploads/2025-05/0196b517-968d-76d9-9301-db6038734f79\" title=\"\"><figcaption><em>Source: </em><a data-ct-non-breakable=\"null\" href=\"https://international.coinbase.com/?tab=derivatives\" rel=\"null\" target=\"null\" text=\"null\" title=\"https://international.coinbase.com/?tab=derivatives\"><em>Coinbase</em></a></figcaption></figure><p><em><strong>Magazine: </strong></em><a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/magazine/ai-sycophancy-crazy-snowballing-psychosis-child-porn-jailbreak-fears-ai-eye/\" rel=\"null\" target=\"null\" text=\"null\" title=\"null\"><em><strong>ChatGPT a ‘schizophrenia-seeking missile,’ AI scientists prep for 50% deaths: AI Eye</strong></em></a></p><p><img src=\"https://images.cointelegraph.com/images/373_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9hNGFkNDk1ZmMwNGJkOTdmNzE2NDlhNDhkNjAwM2QwMC5wbmc=.png\"></p><form novalidate=\"novalidate\" data-ct-widget=\"newsletter-subscription-form\"><p>Explore more articles like this</p><p>Subscribe to our Crypto Biz newsletter</p><p>Weekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday</p><div><p><img src=\"https://s3.cointelegraph.com/storage/uploads/view/9eae0e798df83a1530d957f23cb4573e.svg\" decoding=\"async\" fetchpriority=\"high\" loading=\"lazy\"></p></div><p>By subscribing, you agree to our <a target=\"_blank\" href=\"https://cointelegraph.com/terms-and-privacy\">Terms of Services and Privacy Policy</a></p><!----></form></div></div>",
      "image": null,
      "summary": "Crypto firms are rushing back into the US market after a year of favorable regulatory clarity, but will they put their own interests ahead of investors' safety?"
    },
    {
      "original": "https://cryptopanic.com/news/21712322/4000000-XRP-Accumulation-XRP-Whales-Are-Ready?mtm_campaign=API-OFA",
      "resolved": "https://u.today/4000000-xrp-accumulation-xrp-whales-are-ready",
      "title": "XRP Whales Just Made A Massive Move - 4 Million Coins Suddenly Vanished",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n                                                                <p><img src=\"https://u.today/sites/default/files/styles/736/public/2025-05/s7137.jpg\" alt=\"4,000,000 XRP Accumulation: XRP Whales Are Ready\">\n                                        \n\n\n                                        \n                                                                                                        </p>\n                                                                    <figcaption title=\"https://www.freepik.com/premium-ai-image/whale-leaping-out-smartphone-screen_329596146.htm#position=1\">Cover image via <a href=\"https://www.freepik.com/premium-ai-image/whale-leaping-out-smartphone-screen_329596146.htm#position=1\">www.freepik.com</a></figcaption>\n                                \n                                                                                                                                    <div>\n                                        <p>Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions.  We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.</p>\n                                    </div>\n\n                                                                                            </div><div>\n\n                                                                                        <p dir=\"ltr\">Technical indicators and on-chain metrics indicate that whales are preparing for another round of accumulation-fueled growth, drawing attention to <a href=\"https://u.today/xrp-price-prediction-for-may-10-0\">XRP</a>'s market behavior once more in the cryptocurrency space. With over 4 million transactions recorded in the last three days — a sharp rise over the pre-pump baseline — the recent spike in network activity reveals powerful and unusual <a rel=\"dofollow\" href=\"https://www.tradingview.com/\">movement</a>.</p> <p dir=\"ltr\">Peer-to-peer transactions have increased, indicating not only interest but also capital movement. In terms of price action, XRP has recently surpassed its multi-month descending triangle formation and made a clear break through important resistance levels at $2.20. Before reversing slightly, the price reached $2.47, which is a healthy correction consistent with post-breakout behavior.</p><figure><img alt=\"Article image\" src=\"https://u.today/sites/default/files/inline-images/image_2095.png\" data-entity-uuid=\"3d20b516-7686-4f5f-bdd6-fae614bb1338\" data-entity-type=\"file\"><figcaption><a rel=\"dofollow\" href=\"https://www.tradingview.com/\">XRP/USDT Chart by TradingView</a></figcaption></figure><p dir=\"ltr\">As of right now, XRP is trading above the 50, 100 and 200-day EMAs, which is an unquestionably bullish technical pattern that offers a strong basis for future gains. The RSI, which is currently at 59, is still high but within reasonable bounds, allowing for further growth without immediately indicating overbought conditions. Alongside the consolidation breakout, there has been a spike in volume, which is more proof that actual demand, not speculation, is driving the current momentum.</p><div>\n                    <p>You Might Also Like</p>\n                    <div>\n                      <p><img src=\"https://u.today/sites/default/files/styles/300/public/2025-05/58170.jpg\" width=\"300\" height=\"199\" alt=\"Title news\"></p>\n                      \n                    </div>\n                  </div> <p dir=\"ltr\">Beginning around May 8, the <a href=\"https://u.today/xrp-still-primed-for-3-as-open-interest-retains-5-rally\">XRP</a> Ledger analytics payments chart demonstrates a noticeable increase in transaction volume, reaching a peak of over 1.3 million payments in a single day and maintaining steady levels above 1 million payments per day. This adds up to over 4 million account-to-account transactions in just three days, indicating extensive movement that is probably caused by internal ecosystem reorganization or whale reallocation.</p><p dir=\"ltr\">The next target range is $2.70-$3.00 if <a href=\"https://u.today/blackrock-in-crypto-talks-with-sec-xrp-etf-coming\">XRP</a> keeps support above $2.20 and keeps consolidating around this breakout level. Volume and network activity indicate there is sufficient energy for a move higher. Although there is a chance that the breakout line will be retested, the bullish bias will continue as long as $2.20 holds. In summary, whales are moving, volume is increasing, and XRP seems to be preparing for a long push, possibly toward $3 if this momentum continues.</p>\n            \n                                                                                            </div></div>",
      "image": "https://u.today/sites/default/files/styles/twitterwithoutlogo/public/2025-05/s7137.jpg",
      "summary": "Whales stockpile 4 million XRP as on-chain metrics signal another round of accumulation-fueled growth."
    },
    {
      "original": "https://cryptopanic.com/news/21712277/Coinbase-CEO-US-Government-to-Own-600-Billion-Bitcoin-Reserves-Saylor-Plans-More-Buys-Keiser-Draper-Predict-Price-Surge?mtm_campaign=API-OFA",
      "resolved": "https://thedefiant.io/news/markets/coinbase-ceo-us-government-to-own-600-billion-bitcoin-reserves-saylor-plans-more-76b64f2e",
      "title": "Coinbase CEO: US Government to Own $600 Billion Bitcoin Reserves; Saylor Plans More Buys; Keiser, Draper Predict Price Surge",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div><p>By: <a href=\"https://thedefiant.io/author/deepnewz\">DeepNewz</a> • 0 hours ago</p></div><div><p>Coinbase CEO has stated that the U.S. government is expected to own over $600 billion in Bitcoin reserves, with plans to purchase $100 billion in Bitcoin soon. Billionaires Max Keiser and Tim Draper have expressed bullish views on Bitcoin's future value, with Keiser predicting a price of $850,000 during this cycle and Draper suggesting it could reach \"infinity.\" Michael Saylor, a prominent Bitcoin advocate and executive chairman of MicroStrategy Inc., has called for the U.S. to buy Bitcoin and indicated that other countries may have to purchase it at prices as high as $50 million. Saylor has also announced plans to buy more Bitcoin imminently, as reflected in his publicly shared \"Saylor Tracker\" chart, which signals another Bitcoin purchase is forthcoming.</p><p><em>This is an AI-generated article powered by DeepNewz, curated by The Defiant. For more information, including article sources, visit <a href=\"https://deepnewz.com/markets/coinbase-ceo-us-government-to-own-600-billion-bitcoin-reserves-saylor-plans-more-76b64f2e\" target=\"__blank\" rel=\"noopener noreferrer \">DeepNewz</a>.</em></p></div></div>",
      "image": null,
      "summary": "The US government is buying up Bitcoin by the boatload - and top crypto bulls are predicting prices that will blow your mind."
    },
    {
      "original": "https://cryptopanic.com/news/21712270/Lido-DAO-Responds-to-Chorus-One-Key-Leak?mtm_campaign=API-OFA",
      "resolved": "https://coincu.com/336985-lido-dao-chorus-one-key-leak/",
      "title": "Crypto Crisis Averted: Lido DAO Takes Swift Action Against Chorus One Leak",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div><p><b>Key Points:</b></p><ul><li>Lido DAO addressed a key leak from Chorus One by replacing the oracle node.</li><li>The protocol operates normally despite the compromised key.</li><li>Stakeholders show confidence in Lido’s multisignature security system.</li></ul></div>\n<p>Lido DAO initiated an <a href=\"https://research.lido.fi/t/emergency-rotation-of-compromised-chorus-one-oracle/10037\" rel=\"nofollow noopener\" target=\"_blank\">emergency proposal</a> on May 11, 2025, to replace a Chorus One-operated oracle node due to a suspected key leak.</p>\n<p>The swift response underscores Lido’s security resilience, cementing its stakeholder trust in using a multisignature system that precludes systemic risk.</p>\n<h2>Lido Resolves Security Challenge with Rapid Action</h2>\n<p><strong>Lido DAO recently initiated an emergency proposal</strong> to replace a single oracle node managed by Chorus One, driven by concerns regarding a potential private key leak. Lido employs a 9-of-5 multisignature system to safeguard the protocol’s operations, ensuring stability and security despite the compromised node.</p>\n<p><strong><a href=\"https://coincu.com/325895-sam-bankman-frieds-last-ditch-effort\">This incident reinforced the integrity</a></strong> of Lido’s security measures, as the protocol continues to function without observable data anomalies. The unaffected multisignature nodes enable swift, effective resolution of the isolated issue while maintaining normal protocol operations.</p>\n\n<p><strong>Market reactions have been somewhat muted</strong>, as stakeholders express confidence in the protocol’s robust security mechanism. Lido’s handling of the situation was praised for prompt resolution, with no reported disruption to stakers or the overall system integrity.</p>\n<h2>Ethereum’s Market Surges Amid Lido’s Response Confidence</h2>\n<p><strong>Did you know?</strong> <strong>Lido’s use of a 9-out-of-5 multisignature system</strong> not only prevents single-point failures but also serves as a critical safeguard, enhancing confidence among Ethereum stakeholders amidst such security challenges.</p>\n<p>Ethereum (ETH) is currently trading at $2,521.10, with a market cap of $304.37 billion, according to CoinMarketCap. It dominates 9.09% of the market, seeing a 4.96% rise in the last 24 hours. Meanwhile, its 7-day increase is 37.66%.</p>\n\n<figure>\n  <a href=\"https://coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file.jpeg\">\n    <img width=\"1072\" height=\"477\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201072%20477'%3E%3C/svg%3E\" alt=\"ethereum-daily-chart-226\" title=\"Lido DAO Responds to Chorus One Key Leak 1\" data-lazy-srcset=\"//coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file.jpeg 1072w, //coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file-300x133.jpeg 300w, //coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file-1024x456.jpeg 1024w, //coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file-768x342.jpeg 768w, //coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file-24x11.jpeg 24w, //coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file-36x16.jpeg 36w, //coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file-48x21.jpeg 48w\" data-lazy-sizes=\"(max-width: 1072px) 100vw, 1072px\" data-lazy-src=\"//coincu.com/wp-content/uploads/2025/05/Ethereum-daily-chart-on-1219-UTC-on-May-11-2025file.jpeg\">\n  </a>\n  <figcaption>Ethereum(ETH), daily chart, screenshot on CoinMarketCap at 12:19 UTC on May 11, 2025. <em>Source: <a href=\"https://coinmarketcap.com/currencies/ethereum/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">CoinMarketCap</a></em></figcaption>\n</figure>\n\n<p>The Coincu research team highlights that <strong>Lido’s quick response has potential regulatory and technological significance</strong>, signaling to markets the importance of multisignature systems. This event may lead to future regulatory focus on similar security protocols and contribute to broader adoption of multisignature mechanisms across the crypto sector. <strong><a href=\"https://coincu.com/325621-crypto-activities-are-now-open-to-us-banks\">We are addressing the security concern</a></strong> by proposing an emergency vote to rotate the compromised key in the HashConsensus contracts for the Accounting Oracle. – Lido DAO Contributors, Emergency Proposals Team, Lido DAO.</p>\n\n\n\n<!-- CONTENT END 1 -->\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t</div></div>",
      "image": "https://coincu.com/wp-content/uploads/2025/05/lido-dao-oracle-upgrade-art.png",
      "summary": "Lido DAO just got hacked, but it's still standing tall - and so are its stakeholders' confidence in multisignature systems."
    },
    {
      "original": "https://cryptopanic.com/news/21712345/Bitcoin-Stalls-Below-All-Time-High-But-Momentum-Is-Brewing?mtm_campaign=API-OFA",
      "resolved": "https://cryptodnes.bg/en/bitcoin-stalls-below-all-time-high-but-momentum-is-brewing/",
      "title": "Bitcoin Teeters at All-Time High as Momentum Builds",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div data-rocket-location-hash=\"99bb46786fd5bd31bcd7bdc067ad247a\" id=\"wrapper\">\n    <header data-rocket-location-hash=\"661dbd98a7c2a6b559417f6eea2dd3ae\">\n        <nav>\n            <div data-rocket-location-hash=\"86e7759ebf0c59d073be9e2ac56e107d\">\n                <p><a href=\"https://cryptodnes.bg/en/\" rel=\"home\"><img src=\"https://cryptodnes.bg/en/wp-content/uploads/sites/2/2025/04/logo.svg\" alt=\"CryptoDnes EN\" decoding=\"async\"></a>                    \n                </p>\n                \n                \n                \n            </div>\n        </nav>\n        \n            </header>\n\t\n<div data-rocket-location-hash=\"003ace8f5a765cd031b2f35c97c9f1a3\">\n\n        \n\n        <p><span>\n\n            <span>\n\n                <span><i></i></span>\n\n                11.05.2025 15:00\n            </span>\n\n            <span>\n\n                <span><i></i></span><strong>1 min. read </strong>\n            </span>\n            <span>\n\n                <span><i></i></span>\n                <a href=\"https://cryptodnes.bg/en/author/alex100oo/\">\n                    Alexander Stefanov                </a>\n\n            </span>\n\n        </span></p><p><span>SHARE:</span>\n\n            <span>\n\n                \n\n\n\n                \n\n\n\n                <a href=\"https://telegram.me/share/url?url=https://cryptodnes.bg/en/bitcoin-stalls-below-all-time-high-but-momentum-is-brewing/&amp;text=Bitcoin%20Stalls%20Below%20All-Time%20High%20%E2%80%94%20But%20Momentum%20Is%20Brewing\" target=\"_blank\" rel=\"nofollow\"><i></i></a>\n\n            </span>\n\n            <span>\n\n                <span>0</span>\n\n                <span>SHARES</span>\n\n            </span>\n\n        </p>        \n        \n\n        <p><span>\n\n            <img width=\"930\" height=\"558\" src=\"https://cryptodnes.bg/en/wp-content/uploads/sites/2/2022/07/bitcoin-6-14.jpg\" alt=\"Bitcoin Stalls Below All-Time High — But Momentum Is Brewing\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://cryptodnes.bg/en/wp-content/uploads/sites/2/2022/07/bitcoin-6-14.jpg 930w, https://cryptodnes.bg/en/wp-content/uploads/sites/2/2022/07/bitcoin-6-14-300x180.jpg 300w, https://cryptodnes.bg/en/wp-content/uploads/sites/2/2022/07/bitcoin-6-14-768x461.jpg 768w\" sizes=\"(max-width: 930px) 100vw, 930px\">\n        </span></p><div>\n\n            <div>\n\n                <p>Bitcoin is holding firm near the $103,000 level, trading sideways after last week’s explosive move past six figures.</p><p>The pause has traders watching closely: is this consolidation just a breather—or the buildup to another major leg up?</p>\n<p>Price action has been tightly compressed since BTC tapped $104,300, forming what some see as a bullish flag near a crucial resistance zone. With the $109,000 all-time high now within striking distance, the pressure is building for a decisive breakout. But while bulls have the upper hand, markets remain cautious as sellers hover near recent highs.</p>\n<p>Under the surface, however, something may be shifting.</p>\n\n\n<p>Fresh on-chain data from <strong><a href=\"https://cryptoquant.com/insights/quicktake/681d057b7388d068efdc3c5c-Hopeful-Signal-from-the-CryptoQuant-Bull-Bear-Market-Cycle-Indicator?utm_source=twitter&amp;utm_medium=sns&amp;utm_campaign=quicktake&amp;utm_content=burakkesmeci\" target=\"_blank\" rel=\"nofollow\">CryptoQuant</a></strong> shows early signs of a potential market transition. Their Bull-Bear Market Cycle indicator—bearish since late February—just flashed its first positive reading in weeks. Though still modest, the upturn in the 30-day moving average suggests mounting bullish pressure. If the short-term trend line overtakes the longer-term 365DMA, it could mirror past moments when Bitcoin entered full-blown rally phases.</p>\n<p>Broader conditions seem to support the setup. Altcoins are gaining traction, macroeconomic volatility has cooled, and investor sentiment is improving. If momentum continues building, Bitcoin could soon move beyond resistance and enter price discovery once more.</p>\n<p>For now, the market waits—but the pieces for a breakout are quietly falling into place.</p>\n\n                \n                                <p dir=\"ltr\">\n                    <a href=\"https://t.me/cryptodnesen\" rel=\"nofollow\">\n                        <img src=\"https://cryptodnes.bg/en/wp-content/themes/cryptodnes/assets/images/telegram-en.jpg\" alt=\"Telegram\">\n                    </a>\n                </p>\n                                \n                <p><span>SHARE:</span>\n                    <span>\n                        \n                        \n\n                        <a href=\"https://telegram.me/share/url?url=https://cryptodnes.bg/en/bitcoin-stalls-below-all-time-high-but-momentum-is-brewing/&amp;text=Bitcoin%20Stalls%20Below%20All-Time%20High%20%E2%80%94%20But%20Momentum%20Is%20Brewing\" target=\"_blank\" rel=\"nofollow\"><i></i></a>\n\n                    </span>\n\n                    <span>\n                        <span>0</span>\n                        <span>SHARES</span>\n                    </span>\n\n                </p>\n\n                </div>\n\n            \n\n            <div>\n\n\n                <p><span>Popular News </span></p><ul><li>\n    <a href=\"https://cryptodnes.bg/en/bitcoin-breakdown-incoming-bloomberg-analyst-predicts-downtrend-ahead/\" title=\"Bitcoin Breakdown Incoming? Bloomberg Analyst Predicts Downtrend Ahead\">\n        <p><span>1</span>\n            <span>\n                <h4>Bitcoin Breakdown Incoming? Bloomberg Analyst Predicts Downtrend Ahead</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        23.04.2025 20:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/spot-bitcoin-etfs-see-best-week-since-2024-amid-market-recovery/\" title=\"Spot Bitcoin ETFs See Best Week Since 2024 Amid Market Recovery\">\n        <p><span>2</span>\n            <span>\n                <h4>Spot Bitcoin ETFs See Best Week Since 2024 Amid Market Recovery</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        27.04.2025 12:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/is-now-the-right-time-to-buy-bitcoin/\" title=\"Is Now the Right Time to Buy Bitcoin?\">\n        <p><span>3</span>\n            <span>\n                <h4>Is Now the Right Time to Buy Bitcoin?</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        23.04.2025 17:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/bitcoin-hits-89000-as-market-chaos-sparks-crypto-surge/\" title=\"Bitcoin Hits $89,000 as Market Chaos Sparks Crypto Surge\">\n        <p><span>4</span>\n            <span>\n                <h4>Bitcoin Hits $89,000 as Market Chaos Sparks Crypto Surge</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        22.04.2025 16:14                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/this-model-suggests-bitcoins-fair-value-is-130k/\" title=\"This Model Suggests Bitcoin’s Fair Value Is $130K\">\n        <p><span>5</span>\n            <span>\n                <h4>This Model Suggests Bitcoin’s Fair Value Is $130K</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        25.04.2025 22:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li></ul>\n            </div>            \n\n            \n\n        </div>\n\n    </div>\n\n<div data-rocket-location-hash=\"f6ed923955cc9c0c9f92f6256875b44d\">\n    <p><span>More Bitcoin News</span>\n    </p>\n    <div data-rocket-location-hash=\"106a9d19587a375ee66f1cc21a42abd1\">            \n            <p><span>Popular News </span></p><ul><li>\n    <a href=\"https://cryptodnes.bg/en/bitcoin-breakdown-incoming-bloomberg-analyst-predicts-downtrend-ahead/\" title=\"Bitcoin Breakdown Incoming? Bloomberg Analyst Predicts Downtrend Ahead\">\n        <p><span>1</span>\n            <span>\n                <h4>Bitcoin Breakdown Incoming? Bloomberg Analyst Predicts Downtrend Ahead</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        23.04.2025 20:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/spot-bitcoin-etfs-see-best-week-since-2024-amid-market-recovery/\" title=\"Spot Bitcoin ETFs See Best Week Since 2024 Amid Market Recovery\">\n        <p><span>2</span>\n            <span>\n                <h4>Spot Bitcoin ETFs See Best Week Since 2024 Amid Market Recovery</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        27.04.2025 12:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/is-now-the-right-time-to-buy-bitcoin/\" title=\"Is Now the Right Time to Buy Bitcoin?\">\n        <p><span>3</span>\n            <span>\n                <h4>Is Now the Right Time to Buy Bitcoin?</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        23.04.2025 17:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/bitcoin-hits-89000-as-market-chaos-sparks-crypto-surge/\" title=\"Bitcoin Hits $89,000 as Market Chaos Sparks Crypto Surge\">\n        <p><span>4</span>\n            <span>\n                <h4>Bitcoin Hits $89,000 as Market Chaos Sparks Crypto Surge</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        22.04.2025 16:14                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li><li>\n    <a href=\"https://cryptodnes.bg/en/this-model-suggests-bitcoins-fair-value-is-130k/\" title=\"This Model Suggests Bitcoin’s Fair Value Is $130K\">\n        <p><span>5</span>\n            <span>\n                <h4>This Model Suggests Bitcoin’s Fair Value Is $130K</h4>\n                <span>\n                    <span>\n                        <span><i></i></span>\n                        25.04.2025 22:00                    </span>\n                    <span>\n                        <span><i></i></span><strong>2 min. read </strong>                    </span>\n                </span>\n            </span>\n        </p>\n    </a>\n</li></ul>        </div>\n</div>\n        \n    <!-- /#footer -->\n    \n</div></div>",
      "image": "https://cryptodnes.bg/en/wp-content/uploads/sites/2/2022/07/bitcoin-6-14.jpg",
      "summary": "Bitcoin stalls below all-time high, but momentum is brewing as the market waits for a breakout."
    },
    {
      "original": "https://cryptopanic.com/news/21711626/Are-Bitcoin-Bears-Losing-Out-31-Million-Wiped-Out-In-BTC-Shorts-Liquidation?mtm_campaign=API-OFA",
      "resolved": "https://www.newsbtc.com/news/bitcoin/are-bitcoin-bears-losing-out-31-million-wiped/",
      "title": "Bitcoin Bears Get Blown Away: $31 Million Short Squeezed in One Brutal Day",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t<figure>\n\t\t\t\t\t\t\t<img width=\"860\" height=\"574\" src=\"https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?fit=860%2C574\" alt=\"Bitcoin\" loading=\"eager\" decoding=\"auto\" fetchpriority=\"high\" srcset=\"https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?w=2120 2120w, https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?w=750 750w, https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?w=768 768w, https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?w=860 860w, https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?w=1536 1536w, https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?w=2048 2048w, https://www.newsbtc.com/wp-content/uploads/2025/05/iStock-485863805.jpg?w=1140 1140w\" sizes=\"(max-width: 860px) 100vw, 860px\" data-pin-no-hover=\"true\">\t\t\t\t\t\t</figure>\n\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<div>\n    <div>\n        <h3>Reason to trust</h3>\n        <p><img src=\"https://www.newsbtc.com/wp-content/uploads/2024/04/logo.png\" data-pin-no-hover=\"true\"></p>\n    </div>\n\n    <div>\n        <div>\n            <div>\n                <svg width=\"12\" height=\"12\" viewBox=\"0 0 12 12\" fill=\"currentColor\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M10.2492 0.703125L4.75078 7.95234L1.5 4.70391L0 6.20391L4.99922 11.2031L12 2.20312L10.2492 0.703125Z\"></path></svg>      \n\n                <p>Strict editorial policy that focuses on accuracy, relevance, and impartiality</p>\n            </div>\n\n            <div>\n                <svg width=\"12\" height=\"12\" viewBox=\"0 0 12 12\" fill=\"currentColor\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M10.2492 0.703125L4.75078 7.95234L1.5 4.70391L0 6.20391L4.99922 11.2031L12 2.20312L10.2492 0.703125Z\"></path></svg>      \n                    \n                <p>Created by industry experts and meticulously reviewed</p>\n            </div>\n\n            <div>\n                <svg width=\"12\" height=\"12\" viewBox=\"0 0 12 12\" fill=\"currentColor\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M10.2492 0.703125L4.75078 7.95234L1.5 4.70391L0 6.20391L4.99922 11.2031L12 2.20312L10.2492 0.703125Z\"></path></svg>      \n                    \n                <p>The highest standards in reporting and publishing</p>\n            </div>\n        </div>\n\n        <div>\n            <div>\n                <div>\n                    <h5>How Our News is Made</h5>\n\n                    \n                </div>\n\n                <p>Strict editorial policy that focuses on accuracy, relevance, and impartiality</p>\n            </div>\n\n            <div>\n                <div>\n                    <h5>Ad discliamer</h5>\n\n                    \n                </div>\n\n                <p>Morbi pretium leo et nisl aliquam mollis. Quisque arcu lorem, ultricies quis pellentesque nec, ullamcorper eu odio.</p>\n            </div>\n        </div>\n    </div>\n</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t<p><span>The Bitcoin price couldn’t sustain the bullish momentum after its ascent to the current all-time-high price of $108,786 in January, leading to a crash to around $74,000 in the following months. However, the premier cryptocurrency appears to have roared back to life.</span></p>\n<p><span>Even as the Bitcoin price sits comfortably above the important six-figure threshold, an important question sticks around — is the <a href=\"https://www.newsbtc.com/news/bitcoin/bitcoin-price-heading-to-137000-market-btc-broke-out/\" target=\"_blank\">bullish run truly back on</a>? Recent on-chain analysis suggests that the market leader might be preparing to resume its bull run.</span></p>\n<h2><b>Binance Witnesses Largest Shorts Liquidation Since April</b></h2>\n<p><span>In a Quicktake post on CryptoQuant, a pseudonymous on-chain analyst, Darkfost, <a href=\"https://cryptoquant.com/insights/quicktake/681f639c342e5f71654aae16-The-largest-short-liquidation-on-Binance-since-BTC-began-its-April-uptrend\" target=\"_blank\" rel=\"nofollow\">revealed</a> that a large number of short positions were opened on Binance as Bitcoin dropped from its current all-time high price. According to the crypto pundit, this part of the derivatives market was a source of significant selling pressure on the price of BTC in the following months.</span></p><div><div id=\"placement_607465_0\"><p><img src=\"https://www.newsbtc.com/wp-content/uploads/2024/05/text-banner-logo-bitstarz.png\" data-pin-no-hover=\"true\"></p><p>BitStarz Player Lands $2,459,124 Record Win! Could you be next big winner? <a href=\"https://b1t5t4rz.com/b8ed98b0f\" target=\"_blank\">Play Now!</a></p></div>\n\n<div id=\"placement_366606_0\"><p><a href=\"https://servedbyadbutler.com/redirect.spark?MID=172179&amp;plid=1897419&amp;setID=366606&amp;channelID=0&amp;CID=378944&amp;banID=519875620&amp;PID=0&amp;textadID=0&amp;tc=1&amp;rnd=7708083&amp;scheduleID=1827583&amp;adSize=728x90&amp;mt=1746968897766739&amp;sw=1280&amp;sh=720&amp;spr=1&amp;referrer=https%3A%2F%2Fwww.newsbtc.com%2Fnews%2Fbitcoin%2Fare-bitcoin-bears-losing-out-31-million-wiped%2F&amp;hc=b7289adc17f94bed1549e2ee76ed35d1862dbc4f&amp;location=\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://servedbyadbutler.com/getad.img/;libID=4267666\" alt=\"\" title=\"\" width=\"728\" height=\"90\" data-pin-no-hover=\"true\"></a></p></div></div>\n\n\n<p><span>Darkfost went on to explain that as the price of BTC started its recovery, these short positions, expectedly — although slowly, got liquidated, becoming buying pressure for the cryptocurrency. This series of slow liquidations, however, spiked on May 8 to a new single-day high since as far back as March.</span></p>\n<p><span>According to <a href=\"https://www.newsbtc.com/news/bitcoin/bitcoin-continues-to-flow-out-major-exchanges/\">CryptoQuant data</a>, over $31 million in short positions were wiped out on Binance, the world’s largest exchange by trading volume. The chart below is of the on-chain indicator showing the amount of liquidations in USD — the ‘Short Liquidations USD’ metric.</span></p>\n<figure><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/img.cryptoquant.com/563193/quicktake/o7Msu4T_45dce8f950851051ab27705fd980bf56d2aca157566ba775176d65f9ec1eb29f.png?resize=1280%2C720&amp;ssl=1\" alt=\"Bitcoin\" width=\"1280\" height=\"720\" loading=\"lazy\" data-pin-no-hover=\"true\"><figcaption>Source: CryptoQuant</figcaption></figure>\n<p><span>Furthermore, Darkfost revealed that the relatively low level of funding rates is around 0.004. This trend suggests the abundant presence of short positions in the market, and also the unwillingness of Binance traders to go long.&nbsp;</span></p><div><div>\n        <p><img src=\"https://servedbyadbutler.com/error/blank.gif\" width=\"0\" height=\"0\" data-pin-no-hover=\"true\">\n\n        </p>\n    </div>\n\n<div id=\"placement_452518_0\"><p><a href=\"https://servedbyadbutler.com/redirect.spark?MID=172179&amp;plid=2984482&amp;setID=452518&amp;channelID=0&amp;CID=1176618&amp;banID=523115562&amp;PID=0&amp;textadID=0&amp;tc=1&amp;rnd=7708083&amp;scheduleID=2929195&amp;adSize=728x90&amp;mt=1746968897854026&amp;sw=1280&amp;sh=720&amp;spr=1&amp;referrer=https%3A%2F%2Fwww.newsbtc.com%2Fnews%2Fbitcoin%2Fare-bitcoin-bears-losing-out-31-million-wiped%2F&amp;hc=4bf7f066e7512f81defe5d1bd92205374a6daa21&amp;location=\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://servedbyadbutler.com/getad.img/;libID=4539010\" alt=\"\" title=\"\" width=\"728\" height=\"90\" data-pin-no-hover=\"true\"></a></p></div></div>\n<figure><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/img.cryptoquant.com/563193/quicktake/VvKPZD_e2a81f3c99c47ffd4406b2c2e9ab3753b9fae3efc63b607a3406a0848a159be4.png?resize=1280%2C720&amp;ssl=1\" alt=\"Bitcoin\" width=\"1280\" height=\"720\" loading=\"lazy\" data-pin-no-hover=\"true\"><figcaption>The chart shows the funding rates at BTC’s current price to be around the 0.004 level | Source: CryptoQuant</figcaption></figure>\n<p><span>Darkfost concluded that further liquidations or closures of these short positions could cause Bitcoin’s bullish trend to regain its momentum, thus facilitating further growth of the premier cryptocurrency. The crypto analyst also mentioned the possibility that this potential regain of bullish strength could push the flagship cryptocurrency to <a href=\"https://www.newsbtc.com/news/bitcoin/is-bitcoin-headed-for-a-new-ath-after-104000-triumph-what-this-market-expert-thinks/\" target=\"_blank\">break above its previous all-time-high price</a>.</span></p>\n<h2><b>Bitcoin Price At A Glance</b></h2>\n<p><span>As of this writing, the price of BTC stands at around $104,335, reflecting an over 1% increase in the past day. According to CoinGecko data, the flagship cryptocurrency has grown by nearly 9% in the past seven days.</span></p>\n\n\n<figure><img loading=\"lazy\" decoding=\"async\" src=\"https://www.tradingview.com/x/5v71oLON/\" alt=\"Bitcoin\" width=\"1674\" height=\"1384\" data-pin-no-hover=\"true\"><figcaption>The price of BTC on the daily timeframe | Source: BTCUSDT chart on <a href=\"https://www.tradingview.com/x/5v71oLON/\" target=\"_blank\">TradingView</a></figcaption></figure>\n<p>Featured image from iStock, chart from TradingView</p><div><div>\n        <p><img src=\"https://servedbyadbutler.com/error/blank.gif\" width=\"0\" height=\"0\" data-pin-no-hover=\"true\">\n\n        </p>\n    </div>\n\n<div id=\"placement_452519_0\"><p><a href=\"https://servedbyadbutler.com/redirect.spark?MID=172179&amp;plid=2714002&amp;setID=452519&amp;channelID=0&amp;CID=986040&amp;banID=522624379&amp;PID=0&amp;textadID=0&amp;tc=1&amp;rnd=7708083&amp;scheduleID=2635036&amp;adSize=728x90&amp;mt=1746968897885428&amp;sw=1280&amp;sh=720&amp;spr=1&amp;referrer=https%3A%2F%2Fwww.newsbtc.com%2Fnews%2Fbitcoin%2Fare-bitcoin-bears-losing-out-31-million-wiped%2F&amp;hc=6d2b1f59ccbbcd601d2b7ae95d6b8d23ef411cf1&amp;location=\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://servedbyadbutler.com/getad.img/;libID=4481337\" alt=\"\" title=\"\" width=\"728\" height=\"90\" data-pin-no-hover=\"true\"></a></p></div></div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t<div id=\"author-box\">\n\t\t<p><img alt=\"Opeyemi Sule\" src=\"https://www.newsbtc.com/wp-content/uploads/2023/10/nbtc-ope.jpg?resize=200%2C200\" srcset=\"https://www.newsbtc.com/wp-content/uploads/2023/10/nbtc-ope.jpg?resize=200%2C200 2x\" height=\"80\" width=\"80\" data-pin-no-hover=\"true\">\t\t</p>\n\t\t<div id=\"b067dce8b5c75fcc2e5ad570fd1d62c3b8d12a2a\">\n\t\t\n\t<p>Opeyemi is a proficient writer and enthusiast in the exciting and unique cryptocurrency realm. While the digital asset industry was not his first choice, he has remained absolutely drawn since making a foray into the space over two years. Now, Opeyemi takes pride in creating unique pieces unraveling the complexities of blockchain technology and sharing insights on the latest trends in the world of cryptocurrencies.</p>\n\n\t\t\t\n\t\t\n\t\t\n\t\t</div>\n\n\t\t\n\t</div>\n\t\t\t\t\t\t<p><strong>Disclaimer:</strong> The information found on NewsBTC is for educational purposes\n\t\t\t\t\t\t\tonly. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any\n\t\t\t\t\t\t\tinvestments and naturally investing carries risks. You are advised to conduct your own\n\t\t\t\t\t\t\tresearch before making any investment decisions. Use information provided on this website\n\t\t\t\t\t\t\tentirely at your own risk.</p>\n\t\t\t\t\t\t\n\t\t\t\t\t\t<div id=\"placement_366606_1\"><p><a href=\"https://servedbyadbutler.com/redirect.spark?MID=172179&amp;plid=1897419&amp;setID=366606&amp;channelID=0&amp;CID=378944&amp;banID=519875620&amp;PID=0&amp;textadID=0&amp;tc=1&amp;rnd=7708083&amp;scheduleID=1827583&amp;adSize=728x90&amp;mt=1746968897892339&amp;sw=1280&amp;sh=720&amp;spr=1&amp;referrer=https%3A%2F%2Fwww.newsbtc.com%2Fnews%2Fbitcoin%2Fare-bitcoin-bears-losing-out-31-million-wiped%2F&amp;hc=428b3d2843f957e37574cc3fdeff01c9a5f47c94&amp;location=\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://servedbyadbutler.com/getad.img/;libID=4267666\" alt=\"\" title=\"\" width=\"728\" height=\"90\" data-pin-no-hover=\"true\"></a></p></div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t</div></div>",
      "image": null,
      "summary": "Bitcoin's short squeeze liquidation spree continues, but will it be enough to revive the bull run?"
    },
    {
      "original": "https://cryptopanic.com/news/21712173/Solana-Price-Eyes-Breakout-To-200-As-Superstate-Launches-Stock-Platform?mtm_campaign=API-OFA",
      "resolved": "https://www.thecoinrepublic.com/2025/05/11/solana-price-eyes-breakout-to-200-as-superstate-launches-stock-platform/",
      "title": "Solana Price Set To Explode Past $200 As Superstate's Stock Platform Launches With A Bang",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div data-td-block-uid=\"tdi_122\">\n<p>Solana (SOL) price is gaining momentum as technical patterns and network growth signal a potential price breakout. The altcoin touched $160 recently and further surged to $174.31, driven by increasing investor interest, a surge in short liquidations, and broader market support from Bitcoin’s rally. </p>\n\n\n\n<p>Market analysts now predict a rally toward $200, driven by a combination of a bullish price pattern, strong on-chain activity, and new developments such as Superstate’s Opening Bell platform.</p>\n\n\n\n<h2 id=\"h-solana-price-inverse-head-and-shoulders-pattern-points-to-possible-breakout\"><strong>Solana Price Inverse Head-and-Shoulders Pattern Points to Possible Breakout</strong></h2>\n\n\n\n<p>Analysts are observing an inverse head-and-shoulders pattern on Solana’s higher time frame. This formation is often seen as a <a href=\"https://www.thecoinrepublic.com/2025/05/05/solana-price-eyes-200-after-50-rebound-whale-accumulation/\">potential signal</a> for a future uptrend. According to a post on X by crypto analyst Crypto Zeinab, the neckline of this pattern lies at the $160 level, which has already been tested.</p>\n\n\n\n<p>If Solana price holds above $160, traders anticipate a breakout that could take the price to $180 and even $200. This technical setup aligns with current market activity, as rising demand and favorable conditions increase the chances of this pattern playing out. The pattern has developed over several weeks, which adds weight to its potential reliability.</p>\n\n\n<div>\n<figure><img fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"899\" src=\"https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431-1024x899.png\" alt=\"\" srcset=\"https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431-1024x899.png 1024w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431-300x264.png 300w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431-768x675.png 768w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431-150x132.png 150w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431-696x611.png 696w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431-1068x938.png 1068w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/image-431.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"><figcaption>Source: X</figcaption></figure></div>\n\n\n<p>Market participants are closely watching for confirmation of the breakout above the neckline. Should volume and price action confirm this move, further gains toward the $200 mark may follow. The current trend remains positive, with price momentum supporting a bullish continuation.</p>\n\n\n\n<h2 id=\"h-short-liquidations-cross-30-million-as-solana-price-surges\"><strong>Short Liquidations Cross $30 Million as Solana Price Surges</strong></h2>\n\n\n\n<p>On-chain data from Coinglass shows that <a href=\"https://www.thecoinrepublic.com/2025/05/05/solana-price-eyes-200-after-50-rebound-whale-accumulation/\">over $30 million</a> in short positions were liquidated in recent days. On May 8 alone, more than $18 million in shorts were closed as Solana’s price surged. This sharp move forced many traders betting against the price to cover their positions, which added to buying pressure.</p>\n\n\n\n<p>These liquidations occurred after a brief period of price consolidation around $150, followed by a breakout toward $167. This price action is consistent with a short squeeze, where rising prices force short sellers to exit their positions. As more shorts are liquidated, the upward price movement becomes stronger.</p>\n\n\n\n<figure><img decoding=\"async\" width=\"1600\" height=\"548\" src=\"https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1.png\" alt=\"\" srcset=\"https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1.png 1600w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1-300x103.png 300w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1-1024x351.png 1024w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1-768x263.png 768w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1-1536x526.png 1536w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1-150x51.png 150w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1-696x238.png 696w, https://www.thecoinrepublic.com/wp-content/uploads/2025/05/Source-a-hrefhttpswww.coinglass.comcurrenciesSOLCoinGlassa-1-1-1068x366.png 1068w\" sizes=\"(max-width: 1600px) 100vw, 1600px\"><figcaption>Source: CoinGlass</figcaption></figure>\n\n\n\n<p>Liquidation data also shows an increasing long/short ratio, which reached a monthly high of 1.05. This means more traders are opening long positions, expecting prices to continue rising. The rise in open interest to $5.84 billion further supports the case for growing investor confidence and positioning toward higher prices.</p>\n\n\n\n<h2 id=\"h-sol-strategies-buys-18-2-million-worth-of-sol-tokens\"><strong>SOL Strategies Buys $18.2 Million Worth of SOL Tokens</strong></h2>\n\n\n\n<p>SOL Strategies, a firm actively involved in the Solana ecosystem, recently purchased 122,524 SOL for $18.2 million. This acquisition increased its total <a href=\"https://www.thecoinrepublic.com/2025/05/05/solana-price-eyes-200-after-50-rebound-whale-accumulation/\">SOL holdings to 391,782 tokens</a>. The company has consistently shown support for Solana by investing and participating in its long-term growth.</p>\n\n\n\n<p>The timing of the purchase aligns with broader developments in the ecosystem, suggesting the company anticipates increased utility and demand. SOL Strategies has stated that it believes in the potential of tokenized equity and its effect on on-chain asset growth. This increased network activity may support the token price by enhancing liquidity and engagement.</p>\n\n\n\n<figure><p>\nhttps://twitter.com/CryptoLifer33/status/1919880352564171078\n</p></figure>\n\n\n\n<p>This investment also coincides with growing institutional interest in Solana and its applications. With blockchain adoption expanding beyond cryptocurrencies, firms like SOL Strategies see value in securing a position early in promising platforms like Solana.</p>\n\n\n\n<h2 id=\"h-superstate-launches-opening-bell-platform-on-solana\"><strong>Superstate Launches Opening Bell Platform on Solana</strong></h2>\n\n\n\n<p>Superstate has channelized its efforts into the platform called Opening Bell, a blockchain based solution to issue shares based on <a href=\"https://www.thecoinrepublic.com/2025/05/05/solana-price-eyes-200-after-50-rebound-whale-accumulation/\">Solana’s infrastructure</a>. This platform aims to allow companies to issue and trade registered equity shares directly on-chain. According to Superstate, the platform uses the same systems that support its tokenized funds, USTB and USCC.</p>\n\n\n\n<p>The Opening Bell platform will use an SEC-registered, blockchain-enabled transfer agent to record and tokenize company shares. These shares will be real equity and not those enwrapped tokens. This method enables 24/7 trading of classical financial instruments in networks based on blockchain technology thus expanding the field of view for global investors.</p>\n\n\n\n<figure><p>\nhttps://twitter.com/solana_daily/status/1920493402694824313\n</p></figure>\n\n\n\n<p>SOL Strategies intend to become the first public company to use the platform to issue shares. The company has entered an informal memorandum of understanding (MoU) with Superstate to pursue this initiative. This partnership can further increase the use cases for Solana and attract more institutional and retail participants to the network.</p>\n</div><div data-td-block-uid=\"tdi_123\">\n\n<p><h4><span>Disclaimer</span></h4></p><p>The contents of this page are intended for general informational purposes and do not constitute financial, investment, or any other form of advice. Investing in or trading crypto assets carries the risk of financial loss. The forecasted data (also called “price prediction”) on this page are subject to change without notice and are not guaranteed to be accurate.</p></div><div data-td-block-uid=\"tdi_142\"><p><a href=\"https://www.thecoinrepublic.com/author/olivia-stephanie/\" title=\"Olivia Stephanie\"><img alt=\"Olivia Stephanie\" src=\"https://www.thecoinrepublic.com/wp-content/uploads/2024/09/Olivia-Stephanie.png\" srcset=\"https://www.thecoinrepublic.com/wp-content/uploads/2024/09/Olivia-Stephanie.png 2x\" height=\"100\" width=\"100\"></a></p><div><p><a href=\"https://www.thecoinrepublic.com/author/olivia-stephanie/\">Olivia Stephanie</a></p><p>Olivia Stephanie is a FinTech enthusiast with a keen understanding of financial markets. Her passion for economics and finance has led her to explore emerging blockchain technology and cryptocurrency markets.</p></div></div></div>",
      "image": "https://www.thecoinrepublic.com/wp-content/uploads/2025/05/0f72d18ba2384a4fb474392f969aea46.jpeg",
      "summary": "Solana price poised for a breakout as investors pile on, potentially leading the altcoin to $200."
    },
    {
      "original": "https://cryptopanic.com/news/21711594/Eight-Arrested-in-Multi-State-Bank-Fraud-Conspiracy-That-Caused-Over-1500000-in-Losses-DOJ?mtm_campaign=API-OFA",
      "resolved": "https://dailyhodl.com/2025/05/11/eight-arrested-in-multi-state-bank-fraud-conspiracy-that-caused-over-1500000-in-losses-doj/",
      "title": "Bank Heists on the Blockchain: Eight Arrested in $1.5 Million Crypto Con",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t<div><a href=\"https://dailyhodl.com/wp-content/uploads/2025/02/bank-fraud-warn.jpg\"><p><img width=\"750\" height=\"375\" src=\"https://dailyhodl.com/wp-content/uploads/2025/02/bank-fraud-warn.jpg?w=750&amp;h=375&amp;crop=1\" alt=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2025/02/bank-fraud-warn.jpg?resize=360,180 360w, https://dailyhodl.com/wp-content/uploads/2025/02/bank-fraud-warn.jpg?resize=750,375 750w, https://dailyhodl.com/wp-content/uploads/2025/02/bank-fraud-warn.jpg?resize=1140,570 1140w\" sizes=\"(max-width: 750px) 100vw, 750px\"></p></a></div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<p>Prosecutors have handed out prison time for eight individuals involved in a wide-ranging conspiracy of wire, bank and mail fraud.</p>\n<p>In a <a href=\"https://www.justice.gov/usao-mdal/pr/final-sentencing-announced-multi-state-mail-and-bank-fraud-conspiracy-involving-postal\" rel=\"noopener\" target=\"_blank\">press release</a>, the US Attorney’s Office for the Middle District of Alabama says that Hunter Hudson, Jr., and seven other people have been sentenced to prison in an elaborate bank fraud scheme that caused an intended loss amount of more than $1.5 million.</p>\n\n\n<p>The group, which referred to itself in a group chat as the “Fraud Academy,” stole checks, altered them and then deposited them into fraudulent bank accounts, according to prosecutors.</p>\n<p>The US Postal Service aided in the investigation, according to the press release.</p>\n<p>Says Timothy J. O’Malley, Acting Special Agent in Charge with the Federal Bureau of Investigation (FBI),</p>\n<p><em>“Any attempt to exploit our postal or banking systems is a serious violation of the public’s trust. These actions will not be tolerated and will be prosecuted to the fullest extent of the law. Protecting the integrity of our postal and financial systems is essential and non-negotiable.”</em></p>\n<p>25-year-old Hunter Hudson, the ringleader of the operation, was arrested in May of last year. Local news outlet Fox 13 <a href=\"https://www.fox13news.com/news/rappers-lyrics-help-lead-mail-theft-arrest-venice\" rel=\"noopener\" target=\"_blank\">reported</a> that his rap lyrics gave the investigators material for their probe.</p>\n<p>Captain Eric Hill with the Venice Police Department in Florida said that Hudson “drove around throughout the whole region of the United States and he would steal mail.”</p>\n<p><em>“He would wash those checks or use the account information on those checks to then make fraudulent deposits into other individuals’ accounts who would agree to be part of this scam with them.”</em></p>\n<p>Hudson was sentenced to 92 months in prison and was ordered to pay $987,883.50 in restitution and to forfeit $91,020.41.</p>\n<div>\n\n\n\n\n\n\n&nbsp;\n<center><img decoding=\"async\" src=\"https://dailyhodl.com/wp-content/uploads/2018/06/Get-Alerts-728x90.png\" width=\"800\" height=\"99\" data-pin-no-hover=\"true\"></center>\n<h6>Disclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.</h6>\n</div>\n<p><em><span>Generated Image: Midjourney</span></em></p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t</div></div>",
      "image": "https://dailyhodl.com/wp-content/uploads/2025/02/bank-fraud-warn.jpg",
      "summary": "Eight degenerates get prison time for wire, bank and mail fraud scheme that scammed over $1.5 million from unsuspecting victims, while ringleader got 92 months and a stern lecture from the FBI."
    },
    {
      "original": "https://cryptopanic.com/news/21711584/600-Million-Dogecoin-in-48-Hours-Whats-Going-On?mtm_campaign=API-OFA",
      "resolved": "https://u.today/600-million-dogecoin-in-48-hours-whats-going-on",
      "title": "600 Million Dogecoins Unleashed in 48 Shocking Hours - The Mysterious Surge Explained",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n                                                                <p><img src=\"https://u.today/sites/default/files/styles/736/public/2025-05/s7140%20%281%29.jpg\" alt=\"600 Million Dogecoin in 48 Hours: What's Going On?\">\n                                        \n\n\n                                        \n                                                                                                        </p>\n                                                                    <figcaption title=\"https://www.freepik.com/premium-ai-image/forex-trading-concept-coin-graph-chart-financial-analysis-social-media-post-size_136982184.htm#position=28\">Cover image via <a href=\"https://www.freepik.com/premium-ai-image/forex-trading-concept-coin-graph-chart-financial-analysis-social-media-post-size_136982184.htm#position=28\">www.freepik.com</a></figcaption>\n                                \n                                                                                                                                    <div>\n                                        <p>Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions.  We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.</p>\n                                    </div>\n\n                                                                                            </div><div>\n\n                                                                                        <p>Dog-themed cryptocurrency Dogecoin (DOGE) is in the spotlight as on-chain data reveals a stunning accumulation spree by crypto whales. According to crypto analyst <a rel=\"nofollow\" target=\"_blank\" href=\"https://x.com/ali_charts/status/1921296433262846089\">Ali</a>, \"Whales have bought 600 million Dogecoin (DOGE) in the last 48 hours.\"</p> <p>The inflows into Dogecoin from large holders coincide with the current boom in the crypto market, which saw Bitcoin top $104,000 for the first time since January. Dogecoin has also benefited from this bullish momentum; hence, whales could be positioning themselves in anticipation of broader gains.</p><p>At the time of writing, Dogecoin was up 2.26% in the last 24 hours to $0.2334. DOGE has erased slight gains following a significant price jump that spanned three straight days, albeit higher by 35% weekly.</p><p>DOGE is only second behind Ethereum in weekly gains among the top 10 cryptocurrencies by market capitalization, with ETH rising by an impressive 38% over the last seven days.</p> <div>\n                    <p>You Might Also Like</p>\n                    <div>\n                      <p><img src=\"https://u.today/sites/default/files/styles/300/public/2025-05/s7111.jpg\" width=\"300\" height=\"199\" alt=\"Title news\"></p>\n                      \n                    </div>\n                  </div><h2>DOGE price action</h2><p>Dogecoin touched its highest price since Feb. 21 early Sunday, reaching $0.259, continuing its surge from lows of $0.164 on May 6, as Bitcoin nears its current all-time high.</p><p>Along with price gains, Dogecoin open interest has increased by 9.84% in the previous 24 hours to $2.85 billion, a level not seen since mid-February, according to CoinGlass. Open interest reflects the total value of futures contracts that have not yet settled.</p><div>\n                    <p>You Might Also Like</p>\n                    <div>\n                      <p><img src=\"https://u.today/sites/default/files/styles/300/public/2025-05/1000033404.jpg\" width=\"300\" height=\"199\" alt=\"Title news\"></p>\n                      \n                    </div>\n                  </div><p>Dogecoin is currently encountering resistance at Sunday's intraday high of $0.259, close to the daily SMA 200 at $0.265.</p><p>In the coming sessions, a decisive break above the daily SMA 200 would be watched for Dogecoin to advance its rise. On the other hand, support is envisaged at the daily SMA 50 in the event of a price drop. However, if momentum stalls, Dogecoin may consolidate between its daily SMA 50 and 200 for a while before making its next move.</p>\n            \n                                                                                            </div></div>",
      "image": "https://u.today/sites/default/files/styles/twitterwithoutlogo/public/2025-05/s7140%20%281%29.jpg",
      "summary": "Here's your summary:\n\n\"600 million DOGE in 48 hours - what's driving the sudden whale inflows into this dog-themed cryptocurrency?\""
    },
    {
      "original": "https://cryptopanic.com/news/21711570/Dogecoin-Raoul-Pal-Sees-Big-Breakout-Potential-New-Highs-Await?mtm_campaign=API-OFA",
      "resolved": "https://coindoo.com/dogecoin-raoul-pal-sees-big-breakout-potential-new-highs-await/",
      "title": "Dogecoin Ready to Blast Off as Raoul Pal Predicts Big Breakout Potential - New Highs Loom on the Horizon",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n    <p><a href=\"https://coindoo.com/category/altcoins/\">Altcoins</a></p>\n<p><img width=\"915\" height=\"515\" src=\"https://coindoo.com/wp-content/uploads/2025/04/dogecoin-doge-915x515.jpg.webp\" alt=\"Dogecoin: Raoul Pal Sees Big Breakout Potential – “New Highs Await”\" decoding=\"async\" fetchpriority=\"high\"></p>    <ul>\n        <li>11 May 2025</li>\n        <li>|</li>\n        <li>14:30</li>\n    </ul>\n    <p>Raoul Pal, Founder and CEO of Real Vision and a leading macro investor, has once again stirred the crypto conversation—this time with a bold outlook on Dogecoin (DOGE).</p><p>In a tweet posted on May 11, Pal shared a chart of DOGE/BTC and hinted at a bullish breakout, calling it “a potential big flag pattern” and suggesting that “new highs await.”</p>\n\n<p>While acknowledging the irony, Pal stated:</p>\n\n<p>“I still think the most amusing outcome possible would be for <strong><a href=\"https://coindoo.com/cryptocurrencies/dogecoin/\">DOGE</a></strong> to be the hardest currency on earth.”</p>\n<h2>Technical Analysis: Bullish Flag in Formation?</h2>\n<p>The DOGE/BTC chart presented by Pal showcases a pattern of long-term consolidation phases followed by explosive breakouts. According to the image, Dogecoin has historically formed descending flag patterns before surging to new highs—first in 2017, and again in early 2021.</p>\n<p><img decoding=\"async\" src=\"https://coindoo.com/wp-content/uploads/2025/05/GqoYYGCXcAA5SsN-scaled.jpeg\" alt=\"\" width=\"2560\" height=\"1398\" srcset=\"https://coindoo.com/wp-content/uploads/2025/05/GqoYYGCXcAA5SsN-scaled.jpeg 1000w,  https://coindoo.com/wp-content/uploads/2025/05/GqoYYGCXcAA5SsN-300x164.jpeg.webp 300w,  https://coindoo.com/wp-content/uploads/2025/05/GqoYYGCXcAA5SsN-732x400.jpeg.webp 732w,  https://coindoo.com/wp-content/uploads/2025/05/GqoYYGCXcAA5SsN-768x420.jpeg.webp 768w,  https://coindoo.com/wp-content/uploads/2025/05/GqoYYGCXcAA5SsN-1536x839.jpeg.webp 1536w,  https://coindoo.com/wp-content/uploads/2025/05/GqoYYGCXcAA5SsN-2048x1119.jpeg.webp 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"></p>\n<p>Pal highlights that the current structure resembles previous setups, suggesting that DOGE might be setting the stage for yet another breakout relative to <strong><a href=\"https://coindoo.com/cryptocurrencies/bitcoin/\">Bitcoin</a></strong>.</p>\n\n\n<h2>Why This Matters</h2>\n<p>Dogecoin has long been seen as a meme token, but its resilience through multiple market cycles has made it a curious case. With Elon Musk’s continued endorsement, high community engagement, and potential use cases on the horizon, DOGE remains a wildcard in the broader crypto market.</p>\n<p>Raoul Pal’s attention to the asset adds a layer of credibility to what many still consider a joke coin. If DOGE breaks out of its flag pattern, as the chart suggests, it could see renewed momentum—and potentially challenge its previous highs against BTC.</p>\n<h2>Final Thoughts</h2>\n<p>In a world full of surprises, Pal’s tongue-in-cheek prediction might not be far from reality. While traders and analysts debate fundamentals, history has shown that market sentiment and pattern recognition can drive surprising outcomes. Whether or not DOGE becomes the “hardest currency on earth,” it’s certainly back on the radar.</p><!-- CONTENT END 1 -->\n<p><a target=\"_blank\" href=\"https://t.me/coindoo_media\">\n        <img alt=\"telegram\" width=\"932\" height=\"236\" src=\"https://coindoo.com/wp-content/themes/coinpress/images/Banner_en-US_Poppins_new.png\">\n    </a>\n</p><section>\n    <span>Author</span>\n    <div>\n        <div>\n                                <p><img width=\"298\" height=\"300\" src=\"https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-298x300.jpg.webp\" alt=\"\" decoding=\"async\" srcset=\"https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-298x300.jpg.webp 298w,  https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-398x400.jpg.webp 398w,  https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-768x772.jpg.webp 768w,  https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58.jpg.webp 1170w\" sizes=\"(max-width: 298px) 100vw, 298px\">                </p>\n                                            \n            </div>\n                <p>Kosta has been a part of the team since 2021 and has solidified his position with a thirst for knowledge, incredible dedication to his work and a “detective-like” mindset. He not only covers a wide range of trending topics, he also creates reviews, PR articles and educational content. His work has also been referenced by other news outlets.</p>\n            </div>\n</section>\n        \n    </div></div>",
      "image": "https://coindoo.com/wp-content/uploads/2025/04/dogecoin-doge.jpg",
      "summary": "Raoul Pal says Dogecoin is setting up for a big breakout against Bitcoin, calling it \"a potential big flag pattern\" that could lead to new highs."
    },
    {
      "original": "https://cryptopanic.com/news/21711567/Coinbase-CEO-Aims-for-Blockchain-Fueled-Financial-Services-Shift?mtm_campaign=API-OFA",
      "resolved": "https://coincu.com/336979-coinbase-blockchain-financial-services-expansion/",
      "title": "Blockchain's Next Frontier: Coinbase Aims To Revolutionize Financial Services",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div><p><b>Key Points:</b></p><ul><li>Coinbase’s shift toward financial services embraces blockchain; Armstrong leads.</li><li>Stablecoin revenues rose 50% year-on-year in Q1 2025.</li><li>Globalization, product diversification, compliance are key strategies.</li></ul></div>\n<p>Coinbase CEO Brian Armstrong recently revealed plans for the company to evolve into a leading financial services application, leveraging blockchain technology over the next decade.</p>\n<p>Crypto’s expansion into financial services could transform sectors like real estate and securities; Coinbase’s strategy enhances stablecoin and lending services to capitalize on this trend.</p>\n<h2>Coinbase’s Global Strategy Boosts Stablecoin and Lending Growth</h2>\n<p>Coinbase’s <strong>new strategy</strong>, as articulated by CEO Brian Armstrong, focuses on adopting blockchain technology to reinvent financial services worldwide. Armstrong emphasized the role of <strong>crypto</strong> in reshaping conventional sectors such as real estate and finance, asserting that <strong>blockchain technology</strong> will continue expanding its reach.</p>\n<p><strong>Coinbase’s immediate focus</strong> includes diversification into <strong>stablecoin payments</strong> and <strong>crypto lending</strong>. The company <a href=\"https://investor.coinbase.com/files/doc_financials/2025/q1/Q1-25-Earnings-Call-Transcript.pdf\" rel=\"nofollow noopener\" target=\"_blank\">reported a 50% rise in stablecoin revenue</a> from Q1 2024, highlighting its growing economic significance. This shift underscores the firm’s commitment to harnessing blockchain’s capabilities.</p>\n\n<p><strong>Market reactions</strong> have been optimistic, with investors supporting Coinbase’s <strong>global strategies</strong>. Brian Armstrong stated, <strong><a href=\"https://coincu.com/325820-coinbase-derivatives-crypto-futures-trading/\">“Crypto is eroding financial services,”</a></strong> reinforcing his vision of blockchain’s pivotal role. Federal Reserve statements hinted at cautious regulatory optimism towards integrating blockchain with traditional finance. Armstrong also noted during an earnings call, <em>“Our strategy rests on expanding product lines, promoting globalization, and strengthening compliance.”</em> This demonstrates Coinbase’s commitment to a broad, future-facing strategy.</p>\n<h2>Bitcoin Surges Past $104K Amid Coinbase’s Visionary Moves</h2>\n<p><strong>Did you know?</strong> Brian Armstrong’s vision for a blockchain-driven financial future echoes similar sentiments expressed by major tech moguls, foreshadowing a paradigm shift comparable to e-commerce’s influence on retail decades ago.</p>\n<p>Bitcoin (BTC) reached $104,455.24, supported by a market cap of formatNumber(2074819496550, 2). It holds a market dominance of 62.19%, according to <a href=\"https://coinmarketcap.com/\" rel=\"nofollow noopener\" target=\"_blank\">CoinMarketCap</a>. BTC’s price grew 0.85% over 24 hours, marking a 26.59% surge over 30 days, as per the latest data update on May 11, 2025.</p>\n\n<figure>\n  <a href=\"https://coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file.jpeg\">\n    <img width=\"1072\" height=\"477\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201072%20477'%3E%3C/svg%3E\" alt=\"bitcoin-daily-chart-825\" title=\"Coinbase CEO Aims for Blockchain-Fueled Financial Services Shift 1\" data-lazy-srcset=\"//coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file.jpeg 1072w, //coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file-300x133.jpeg 300w, //coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file-1024x456.jpeg 1024w, //coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file-768x342.jpeg 768w, //coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file-24x11.jpeg 24w, //coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file-36x16.jpeg 36w, //coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file-48x21.jpeg 48w\" data-lazy-sizes=\"(max-width: 1072px) 100vw, 1072px\" data-lazy-src=\"//coincu.com/wp-content/uploads/2025/05/Bitcoin-daily-chart-on-1120-UTC-on-May-11-2025file.jpeg\">\n  </a>\n  <figcaption>Bitcoin(BTC), daily chart, screenshot on CoinMarketCap at 11:20 UTC on May 11, 2025. <em>Source: <a href=\"https://coinmarketcap.com/currencies/bitcoin/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">CoinMarketCap</a></em></figcaption>\n</figure>\n\n<p>The Coincu research team highlights the <strong>potential for blockchain</strong> to redefine regulatory perspectives, albeit cautiously, as traditional assets integrate with cryptocurrencies. This evolution may prompt a <strong><a href=\"https://coincu.com/325132-singularitynet-launches-first-decentralized-ai/\">**balanced regulatory**</a></strong> approach by governments, supporting both innovation and <strong>compliance</strong> frameworks within the industry.</p>\n\n\n\n<!-- CONTENT END 1 -->\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\n\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t</div></div>",
      "image": "https://coincu.com/wp-content/uploads/2025/05/coinbase-blockchain-pivot-cartoon.png",
      "summary": "Bitcoin surges past $104K as Coinbase CEO Brian Armstrong envisions a blockchain-driven financial future."
    },
    {
      "original": "https://cryptopanic.com/news/21711554/Twitter-Founders-Warning-to-Investors-Could-Be-Why-Bitcoin-Hits-1M?mtm_campaign=API-OFA",
      "resolved": "https://cryptopotato.com/twitter-founders-warning-to-investors-could-be-why-bitcoin-hits-1m/",
      "title": "Twitter Founder's $1M Warning: The Real Reason Bitcoin Will Soar",
      "content": "<div id=\"readability-page-1\" class=\"page\"><article id=\"post-395889\">\n\t\t\t<div>\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p>Silicon Valley circles have long viewed Dorsey as the next Steve Jobs because his tech powers are in the same league. Twitter has changed the world and Dorsey’s Square Payments company’s CashApp was a very early corporate innovator in Bitcoin.</p>\n<p>Way back in 2019, CashApp started offering BTC custody services that account holders could buy with their credit card. Overnight, its users began doing on a smaller scale precisely what has made MicroStrategy (now Strategy) a Wall Street sensation more lately.</p>\n<p>Today, Square is named Block. Its shares just <a href=\"https://www.cnbc.com/2025/05/02/block-stock-cash-app-downgrades.html\" data-wpel-link=\"external\" target=\"_blank\">plunged by</a> 20% to start off May. Dorsey warned investors of turbulent times for the US consumer strength. Ironically, while that’s not good news for Block’s business model, it could be the catalyst that drives Bitcoin’s price to $1 million.</p>\n<h2>Consumer Weakness to Spur Fed Rate Cut?</h2>\n<p>After Block’s earnings report, the CEO of one of the largest payment processing apps in the world said consumer spending <a href=\"https://pro.thestreet.com/portfolio/jack-dorsey-issues-clear-warning-as-block-shares-reel\" data-wpel-link=\"external\" target=\"_blank\">has shifted</a> dramatically.</p>\n<blockquote><p>“This coincided with inflows coming in below our expectations. During the quarter, non-discretionary Cash App Card spend in areas like grocery and gas was more resilient, while we saw a more pronounced impact on discretionary spending in areas like travel and media. We believe this consumer softness was a key driver of our forecast miss.”</p></blockquote>\n<p>The cutbacks on spending drove lower sales in Q1, which <a href=\"https://www.reuters.com/business/stockpiling-ahead-tariffs-likely-hurt-us-economy-first-quarter-2025-04-30/\" data-wpel-link=\"external\" target=\"_blank\">saw the</a> US economy shrink for the first quarter in three years. If it happens for a second quarter in a row, it meets the most commonly used definition of a recession by formal economists.</p>\n\n<p>As a result, the central bank is apt to cut interest rates to get business going again. A CNBC survey <a href=\"https://www.cnbc.com/2025/05/06/wobbling-economy-will-push-the-fed-to-cut-interest-rates-later-this-year-cnbc-survey-finds.html\" data-wpel-link=\"external\" target=\"_blank\">finds rate</a> cuts likely this year due to the wobbling economy.</p>\n<p>That could be what launches BTC prices again to the $1 million level, as Dorsey <a href=\"https://cryptopotato.com/heres-when-bitcoin-btc-price-will-skyrocket-to-1-million-according-to-jack-dorsey/\" data-wpel-link=\"internal\">has previously</a> predicted.</p>\n<h2>Dorsey Forecasts $1 Million BTC by 2030</h2>\n<p>When the Fed cut rates in 2007-08, Bitcoin started operating for the first time. During the ensuing multi-year low interest rate regime, BTC prices soared from thousandths of a penny to $20,000 by Dec. 2017.</p>\n<p>By then, the Fed had raised rates again, and Bitcoin’s price had crashed. It began to recover after the Fed slashed rates again in 2020 and soared to a new record high of $69,000 by Nov. 2021.</p>\n<p>The landscape seems rather similar now, but BTC’s price is actually well above $100,000 even after the Fed’s third consecutive refusal to lower the rates.</p>\n<div><center><span>SPECIAL OFFER (Sponsored)</span></center>\n<p><b>Binance Free $600 (CryptoPotato Exclusive): <a href=\"https://cryptopotato.com/binance600f/\" rel=\"nofollow\" data-wpel-link=\"internal\">Use this link</a> to register a new account and receive $600 exclusive welcome offer on Binance</b> (<a href=\"https://cryptopotato.com/binance600d/\" data-wpel-link=\"internal\">full details</a>).</p><p>\n<b>LIMITED OFFER for CryptoPotato readers at Bybit: <a href=\"https://cryptopotato.com/pl/bybit24/\" rel=\"nofollow\" data-wpel-link=\"internal\">Use this link</a> to register and open a $500 FREE position on any coin!</b></p></div>\n<!-- AI CONTENT END 1 -->\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\n\t\t\t\t\t\n\n\t\t\t\t\t<hr>\n\t\t\t\t\t\n\t\t\t\t</div>\n\n\t\t\t\n\n\t\t\t\n\n\n\n\t\t</article></div>",
      "image": "https://cryptopotato.com/wp-content/uploads/2021/11/Jack-Dorsey.jpg",
      "summary": "Block's shares tank after Jack Dorsey warns of a rough patch ahead, but that might just be what sends Bitcoin soaring to $1 million."
    },
    {
      "original": "https://cryptopanic.com/news/21711181/Celsius-Founder-Alex-Mashinsky-Gets-12-Year-Sentence-for-Fraud?mtm_campaign=API-OFA",
      "resolved": "https://voiceofcrypto.online/ampstories/web-stories/celsius-founder-alex-mashinsky-gets-12-year-sentence-for-fraud",
      "title": "Crypto Kingpin Alex Mashinsky Gets 12 Years for His Big Heist",
      "content": "<div id=\"readability-page-1\" class=\"page\"><amp-story data-test-id=\"visual-story\" standalone=\"\" publisher=\"Voice Of Crypto\" publisher-logo-src=\"https://quintype-dropbox.s3-accelerate.amazonaws.com/voiceofcrypto.quintype.com/2024-03-07/481/VOCQuintype_16_9.png\" poster-portrait-src=\"//media.assettype.com/voiceofcrypto/2025-05-11/ulwntd4d/Cover-Celsius-Founder-Alex-Mashinsky-Gets-12-Year-Sentence-for-Fraud.png?w=640&amp;mode=crop&amp;ar=3:4\" i-amphtml-layout=\"container\" muted=\"\" orientation=\"portrait\"><amp-story-page id=\"cover\" i-amphtml-layout=\"container\" role=\"region\" active=\"\" distance=\"0\" aria-hidden=\"false\"><amp-story-grid-layer template=\"fill\" i-amphtml-layout=\"container\"><amp-img alt=\"Crypto, Alex Mashinsky\" animate-in=\"fly-in-top\" animate-in-duration=\"1000ms\" src=\"https://media.assettype.com/voiceofcrypto%2F2025-05-11%2Fulwntd4d%2FCover-Celsius-Founder-Alex-Mashinsky-Gets-12-Year-Sentence-for-Fraud.png\" srcset=\"https://media.assettype.com/voiceofcrypto%2F2025-05-11%2Fulwntd4d%2FCover-Celsius-Founder-Alex-Mashinsky-Gets-12-Year-Sentence-for-Fraud.png?w=640 640w\" layout=\"responsive\" width=\"480\" height=\"640\" i-amphtml-layout=\"responsive\"><i-amphtml-sizer slot=\"i-amphtml-svc\"></i-amphtml-sizer><img decoding=\"async\" sizes=\"(max-width: 1280px) 1280px, 100vw\" alt=\"Crypto, Alex Mashinsky\" srcset=\"https://media.assettype.com/voiceofcrypto%2F2025-05-11%2Fulwntd4d%2FCover-Celsius-Founder-Alex-Mashinsky-Gets-12-Year-Sentence-for-Fraud.png?w=640 640w\" src=\"https://media.assettype.com/voiceofcrypto%2F2025-05-11%2Fulwntd4d%2FCover-Celsius-Founder-Alex-Mashinsky-Gets-12-Year-Sentence-for-Fraud.png\"></amp-img></amp-story-grid-layer><amp-story-grid-layer template=\"vertical\" i-amphtml-layout=\"container\"></amp-story-grid-layer><amp-story-grid-layer template=\"thirds\" i-amphtml-layout=\"container\"><div><p>Krutika Adani</p></div></amp-story-grid-layer></amp-story-page><canvas height=\"3\" width=\"3\"></canvas><amp-story-share-menu></amp-story-share-menu></amp-story></div>",
      "image": null,
      "summary": "Alex Mashinsky, the founder of Celsius, gets slammed with a 12-year sentence for his role in the crypto lending platform's epic collapse - and you won't believe what he's planning next."
    },
    {
      "original": "https://cryptopanic.com/news/21710956/How-to-Spot-a-Bull-Market-Top-According-to-History?mtm_campaign=API-OFA",
      "resolved": "https://coindoo.com/how-to-spot-a-bull-market-top-according-to-history/",
      "title": "When the Market's Green Goes Red: Identifying Bull Tops by Chart History",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n    <p><a href=\"https://coindoo.com/category/bitcoin/\">Bitcoin</a></p>\n<p><img width=\"785\" height=\"515\" src=\"https://coindoo.com/wp-content/uploads/2025/03/bullgreen23-915x600.webp\" alt=\"How to Spot a Bull Market Top, According to History\" decoding=\"async\" fetchpriority=\"high\"></p>    <ul>\n        <li>11 May 2025</li>\n        <li>|</li>\n        <li>14:00</li>\n    </ul>\n    <p>A new chart circulating on crypto Twitter reveals a repeating RSI divergence pattern that has historically preceded local tops in Bitcoin’s price cycles.</p><p data-start=\"292\" data-end=\"604\">&nbsp;With <strong><a href=\"https://coindoo.com/cryptocurrencies/bitcoin/\">BTC</a></strong> now trading above $103,500, the same setup is forming again—prompting speculation that a significant correction or peak could be approaching.</p>\n<h3 data-start=\"606\" data-end=\"658\">The Pattern: Bearish <a>RSI</a> Divergence at Key Highs</h3>\n\n<p data-start=\"660\" data-end=\"943\">The <strong><a href=\"https://x.com/MMCrypto/status/1921426551188430929\">chart</a></strong> shows four previous instances (2014, 2018, 2021, and now 2025) where Bitcoin’s RSI (14-month) formed a lower high while price made a higher high—a classic bearish divergence. Each time, this signaled a local top, followed by significant corrections:</p>\n<ul data-start=\"945\" data-end=\"1195\">\n<li data-start=\"945\" data-end=\"995\">\n<p data-start=\"947\" data-end=\"995\">2014: RSI divergence preceded a <a>bear market</a>.</p>\n</li>\n<li data-start=\"996\" data-end=\"1048\">\n<p data-start=\"998\" data-end=\"1048\">2018: RSI divergence aligned with a macro top.</p>\n</li>\n<li data-start=\"1049\" data-end=\"1121\">\n<p data-start=\"1051\" data-end=\"1121\">2021: Another bearish divergence led to the multi-month downtrend.</p>\n</li>\n<li data-start=\"1122\" data-end=\"1195\">\n<p data-start=\"1124\" data-end=\"1195\">2025: RSI is again turning down near 69 while price hits new highs.</p>\n</li>\n</ul>\n\n<p data-start=\"1197\" data-end=\"1327\">A large finger emoji in the chart highlights the current RSI positioning, emphasizing a potentially critical moment in the market.</p>\n<p data-start=\"1197\" data-end=\"1327\"><img decoding=\"async\" src=\"https://coindoo.com/wp-content/uploads/2025/05/GqpHQygWsAAY7xk.jpeg.webp\" alt=\"\" width=\"1000\" height=\"465\" srcset=\"https://coindoo.com/wp-content/uploads/2025/05/GqpHQygWsAAY7xk.jpeg.webp 1000w,  https://coindoo.com/wp-content/uploads/2025/05/GqpHQygWsAAY7xk-300x140.jpeg.webp 300w,  https://coindoo.com/wp-content/uploads/2025/05/GqpHQygWsAAY7xk-800x372.jpeg.webp 800w,  https://coindoo.com/wp-content/uploads/2025/05/GqpHQygWsAAY7xk-768x357.jpeg.webp 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"></p>\n<h3 data-start=\"1334\" data-end=\"1351\">Price Outlook</h3>\n<p data-start=\"1353\" data-end=\"1695\">The upper price boxes indicate past returns of 1,650% and 348% in previous cycles. With the 2025 price now nearing a local resistance level just above $100K, traders are watching closely to see if this RSI signal once again leads to a correction—or if Bitcoin can break the pattern and push toward new highs above $150K or even $200K.</p>\n\n<h3 data-start=\"1702\" data-end=\"1720\">Why It Matters</h3>\n<p data-start=\"1722\" data-end=\"1988\">Technical patterns like this do not guarantee market reversals but serve as cautionary signals. With RSI nearing overbought levels and bearish divergence appearing again, risk management becomes more important—especially as euphoric sentiment rises in the space.</p>\n<p data-start=\"1990\" data-end=\"2060\">If the pattern holds, a pullback or temporary top may be imminent.</p><!-- CONTENT END 1 -->\n<p><a target=\"_blank\" href=\"https://t.me/coindoo_media\">\n        <img alt=\"telegram\" width=\"932\" height=\"236\" src=\"https://coindoo.com/wp-content/themes/coinpress/images/Banner_en-US_Poppins_new.png\">\n    </a>\n</p><section>\n    <span>Author</span>\n    <div>\n        <div>\n                                <p><img width=\"298\" height=\"300\" src=\"https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-298x300.jpg.webp\" alt=\"\" decoding=\"async\" srcset=\"https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-298x300.jpg.webp 298w,  https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-398x400.jpg.webp 398w,  https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58-768x772.jpg.webp 768w,  https://coindoo.com/wp-content/uploads/2025/03/photo_2025-03-25_16-09-58.jpg.webp 1170w\" sizes=\"(max-width: 298px) 100vw, 298px\">                </p>\n                                            \n            </div>\n                <p>Kosta has been a part of the team since 2021 and has solidified his position with a thirst for knowledge, incredible dedication to his work and a “detective-like” mindset. He not only covers a wide range of trending topics, he also creates reviews, PR articles and educational content. His work has also been referenced by other news outlets.</p>\n            </div>\n</section>\n        \n    </div></div>",
      "image": "https://coindoo.com/wp-content/uploads/2025/03/bullgreen23.webp",
      "summary": "Bitcoin's RSI (14-month) is forming a bearish divergence at key highs for the 4th time in its history, similar to what preceded local tops and significant corrections in 2014, 2018, and 2021."
    }
  ],
  "sentiment": {
    "value": "70",
    "label": "🤑 Ape Season",
    "description": "Twitter threads promising 1000x. Your grandma's buying altcoins."
  },
  "topMessage": {
    "text": "\"Welcome back degens! It's been one hell of a week in crypto with whales stockpiling XRP like it's going out of style (hint: it might be). The US government is dumping Bitcoin by the boatload - literally - but top crypto bulls think prices will get so wild they'll blow your mind. Lido DAO got hacked, but that didn't stop its stakeholders from sticking with multisig systems. Meanwhile, BTC is getting squeezed like a lemon as short sellers scramble to cover their losses.<br /><br />Bitcoin stalled just shy of all-time highs, but we're waiting on a breakout to really get this party started again. Solana price might be about to break out and lead the altcoins in a mad dash for $200 - or your money back. Eight degenerates got prison time for scamming over $1.5 million from unsuspecting victims, while one of the ringleaders got 92 months and a stern lecture from the FBI.<br /><br />Raoul Pal thinks Dogecoin is setting up for a big breakout against Bitcoin, calling it 'a potential big flag pattern' that could lead to new highs (if you believe in dog-themed cryptos, that is). Coinbase CEO Brian Armstrong envisions a blockchain-driven financial future and even Bitcoin surged past $104K because of it. Block's shares tanked after Jack Dorsey warned of a rough patch ahead - but hey, that might just be what sends BTC soaring to $1 million.<br /><br />Alex Mashinsky got",
    "keyTerms": [
      {
        "term": "crypto",
        "articleIndex": 0
      },
      {
        "term": "Bitcoin",
        "articleIndex": 3
      },
      {
        "term": "Dogecoin",
        "articleIndex": 7
      }
    ]
  },
  "gainers": [
    {
      "name": "Pi Network",
      "symbol": "PI",
      "price": "1.16",
      "change": "59.90",
      "icon": "https://coin-images.coingecko.com/coins/images/54342/large/pi_network.jpg?1739347576",
      "link": "https://www.coingecko.com/en/coins/pi-network"
    },
    {
      "name": "Neiro on ETH",
      "symbol": "NEIRO",
      "price": "0.12",
      "change": "54.08",
      "icon": "https://coin-images.coingecko.com/coins/images/39438/large/Neiro.png?1722915026",
      "link": "https://www.coingecko.com/en/coins/neiro-on-eth"
    },
    {
      "name": "Moo Deng",
      "symbol": "MOODENG",
      "price": "0.19",
      "change": "48.09",
      "icon": "https://coin-images.coingecko.com/coins/images/50264/large/MOODENG.jpg?1726726975",
      "link": "https://www.coingecko.com/en/coins/moo-deng"
    },
    {
      "name": "Ether.fi",
      "symbol": "ETHFI",
      "price": "1.10",
      "change": "43.12",
      "icon": "https://coin-images.coingecko.com/coins/images/35958/large/etherfi.jpeg?1710254562",
      "link": "https://www.coingecko.com/en/coins/ether-fi"
    },
    {
      "name": "Peanut the Squirrel",
      "symbol": "PNUT",
      "price": "0.46",
      "change": "38.51",
      "icon": "https://coin-images.coingecko.com/coins/images/51301/large/Peanut_the_Squirrel.png?1734941241",
      "link": "https://www.coingecko.com/en/coins/peanut-the-squirrel"
    }
  ],
  "losers": [
    {
      "name": "Solana Swap",
      "symbol": "SOS",
      "price": "0.17",
      "change": "-9.82",
      "icon": "https://coin-images.coingecko.com/coins/images/50379/large/200X200.png?1727410775",
      "link": "https://www.coingecko.com/en/coins/solana-swap"
    },
    {
      "name": "Gamebitcoin Power",
      "symbol": "PWR",
      "price": "0.10",
      "change": "-9.58",
      "icon": "https://coin-images.coingecko.com/coins/images/53262/large/pwr_200x200.png?1735911290",
      "link": "https://www.coingecko.com/en/coins/gamebitcoin-power"
    },
    {
      "name": "Zebec Network",
      "symbol": "ZBCN",
      "price": "0.00",
      "change": "-7.23",
      "icon": "https://coin-images.coingecko.com/coins/images/37052/large/zbcn.jpeg?1713168241",
      "link": "https://www.coingecko.com/en/coins/zebec-network"
    },
    {
      "name": "Conscious Token",
      "symbol": "CONSCIOUS",
      "price": "0.12",
      "change": "-5.74",
      "icon": "https://coin-images.coingecko.com/coins/images/55111/large/conscious_token_logo.png?1743754945",
      "link": "https://www.coingecko.com/en/coins/conscious-token"
    },
    {
      "name": "Zano",
      "symbol": "ZANO",
      "price": "10.14",
      "change": "-5.53",
      "icon": "https://coin-images.coingecko.com/coins/images/8370/large/zano.png?1696508563",
      "link": "https://www.coingecko.com/en/coins/zano"
    }
  ],
  "wtfExplainer": "What the hell is ShibaCorgi? This token is the result of some dude's Twitter account blowing up because he made a cute corgi with a Shiba INU vibe, then he got drunk one night and said \"Hey, I can make a coin now!\" So, you get this glorified meme token that's just gonna siphon off your hard-earned money in taxes so it can be sent to holders you've never met.",
  "weirdCoin": {
    "name": "ShibaCorgi",
    "symbol": "SHICO",
    "id": "shibacorgi",
    "icon": "https://coin-images.coingecko.com/coins/images/15608/large/shibacorgi-200.jpg?1696515242",
    "link": "https://www.coingecko.com/en/coins/shibacorgi"
  },
  "snarkyWisdom": "\"Always remember, kids: there are two types of investors - those who have been rekt by an altcoin pump and dump, and those who will be.\"",
  "redditresults": [
    {
      "subreddit": "CryptoCurrency",
      "title": "BTC Back Over 104K and People with 0.05 BTC Like",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1kjwt66/btc_back_over_104k_and_people_with_005_btc_like/",
      "score": 913,
      "upvote_ratio": 0.95,
      "nsfw": false,
      "author": "kirtash93"
    },
    {
      "subreddit": "defi",
      "title": "Mobile-First DeFi Trading? My Experience Using Prerich vs. Moonshot + Phantom for Solana Meme Plays",
      "url": "https://reddit.com/r/defi/comments/1kjhcnp/mobilefirst_defi_trading_my_experience_using/",
      "score": 6,
      "upvote_ratio": 0.88,
      "nsfw": false,
      "author": "sara733"
    },
    {
      "subreddit": "CryptoMarkets",
      "title": "Is it the time to buy alts now?",
      "url": "https://reddit.com/r/CryptoMarkets/comments/1kjiavc/is_it_the_time_to_buy_alts_now/",
      "score": 69,
      "upvote_ratio": 0.79,
      "nsfw": false,
      "author": "Ok-Committee1892"
    },
    {
      "subreddit": "CryptoMoonShots",
      "title": "Matt Furie Hints at “Strawberry in Bloom” — A Female Pepe Set to Lead a New Meme Era",
      "url": "https://reddit.com/r/CryptoMoonShots/comments/1kjxa6u/matt_furie_hints_at_strawberry_in_bloom_a_female/",
      "score": 427,
      "upvote_ratio": 0.98,
      "nsfw": false,
      "author": "bkrarsln617"
    }
  ],
  "cryptomeme": {
    "title": "Better keep it secret...",
    "image": "https://i.redd.it/dsofcqddw00f1.png",
    "permalink": "https://reddit.com/r/cryptocurrencymemes/comments/1kjkx4a/better_keep_it_secret/"
  },
  "greeting": "Fellow Degen,\nIf you woke up wondering whether your bags are blessed or cursed, you're in the right inbox. Let's break it down."
}