{
  "subjectLine": "\"BITCOIN TAKES THE LEAP: Crypto Market Melt-Up Continues!\"",
  "articles": [
    {
      "original": "https://cryptopanic.com/news/21681923/Bitcoin-BTC-Climbs-Above-103K-as-Market-Reacts-to-UK-Deal-ETF-Inflows?mtm_campaign=API-OFA",
      "resolved": "https://crypto-economy.com/bitcoin-btc-climbs-above-103k-as-market-reacts-to-uk-deal-etf-inflows/",
      "title": "Bitcoin Surges Past $103K as Market Reacts to UK Trade Deal and Bitcoin ETF Inflows",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div data-id=\"138652c\" data-element_type=\"widget\" data-widget_type=\"theme-post-content.default\">\n\t\t\t<p>TL;DR</p>\n<ul>\n<li><span><strong>Bitcoin has surged past $103,000, marking a 3.51% increase in the last 24 hours</strong> and pushing its individual market capitalization to<strong> $2.04 trillion.</strong></span></li>\n<li><span><strong>A trade deal between the United States and the United Kingdom, combined with strong inflows into bitcoin ETFs,</strong> has sparked massive market optimism.</span></li>\n<li><span><strong>Over $800 million in short positions were liquidated,</strong> with altcoins like Ethereum, Cardano, and Dogecoin soaring between 10% and 20%.</span><br>\n<hr>\n</li>\n</ul>\n<p><span>The crypto market is experiencing one of its most exciting and dynamic moments of the year: <a href=\"https://coinmarketcap.com/currencies/bitcoin/\" target=\"_blank\" rel=\"noopener\"><strong>Bitcoin (BTC)</strong></a> has climbed above $103,000, specifically hitting<strong> $103,069.49, representing a 3.51% gain over the past 24 hours.</strong> This surge has propelled its market capitalization to an impressive <strong>$2.04 trillion</strong>, further cementing its dominance within the digital ecosystem and showcasing its remarkable resilience amid recent macroeconomic pressures and regulatory challenges worldwide. </span></p>\n<p><span>This jump is not happening in isolation: <strong>altcoins like Ethereum (ETH) soared 20%, while Cardano (ADA) and Dogecoin (DOGE) posted gains over 10%.</strong> The buying frenzy has triggered more than <strong>$800 million in short liquidations</strong>, marking the largest figure since 2023 and leaving bearish traders licking their wounds.</span></p>\n<h2><b>Altcoin Explosion Sparks Massive Liquidations</b></h2>\n<p><span>The catalyst behind this bullish frenzy is multi-faceted: <strong>the historic trade agreement between the U.S. and the U.K</strong>. has reignited investor confidence, while<strong> record-breaking inflows into bitcoin ETFs</strong> have shown that institutional demand is far from exhausted or slowing down. According to <strong>CoinGlass data, over 84% of the liquidations came from short positions,</strong> highlighting the strength and speed of the buying momentum. <strong><a href=\"https://crypto-economy.com/binance-exchange-review-complete-guide/\" target=\"_blank\" rel=\"noopener\">Binance</a> and OKX</strong>, two of the world’s largest exchanges,<strong> accounted for more than $500 million in these losses combined,</strong> underscoring the global impact of the rally.</span></p>\n<p><picture fetchpriority=\"high\" decoding=\"async\">\n<source type=\"image/webp\" srcset=\"https://crypto-economy.com//wp-content/uploads/2025/05/Chart-BTC-2.png.webp 825w, https://crypto-economy.com//wp-content/uploads/2025/05/Chart-BTC-2-300x140.png.webp 300w, https://crypto-economy.com//wp-content/uploads/2025/05/Chart-BTC-2-768x359.png.webp 768w\" sizes=\"(max-width: 825px) 100vw, 825px\">\n<img fetchpriority=\"high\" decoding=\"async\" src=\"https://crypto-economy.com//wp-content/uploads/2025/05/Chart-BTC-2.png\" alt=\"Chart BTC\" width=\"825\" height=\"386\" srcset=\"https://crypto-economy.com//wp-content/uploads/2025/05/Chart-BTC-2.png 825w, https://crypto-economy.com//wp-content/uploads/2025/05/Chart-BTC-2-300x140.png 300w, https://crypto-economy.com//wp-content/uploads/2025/05/Chart-BTC-2-768x359.png 768w\" sizes=\"(max-width: 825px) 100vw, 825px\">\n</picture>\n</p>\n<p><span><strong>Ethereum</strong> not only led in profitability but also in volume, <strong>contributing $310 million to total liquidations.</strong> This renewed interest in ETH may be linked to its recent Pectra upgrade, which improves network efficiency and scalability while drawing in both retail and institutional attention. <strong>Solana (SOL), Binance Coin (BNB), and <a href=\"https://crypto-economy.com/ripple/\" target=\"_blank\" rel=\"noopener\">XRP</a> also joined the rally, each posting gains of at least 7%.</strong></span></p>\n<h2><b>Bullish Outlook And Renewed Optimism</b></h2>\n<p><span>Analysts emphasize that these kinds of “short squeezes” are not just fleeting moments of euphoria but signal<strong> a shift in market narrative</strong>. The appetite for risk has returned with force, making it clear that investors are ready to challenge Wall Street’s old rules. </span></p>\n<p><span>With Bitcoin surpassing $103,000, many now see this moment as <strong>an open door to new all-time highs</strong>, fueled by an explosive combination of favorable macroeconomic factors, technological advancements, and growing institutional adoption.&nbsp;</span></p>\n\t\t</div></div>",
      "image": "https://crypto-economy.com//wp-content/uploads/2025/05/Bitcoin-Bull-Market.png",
      "summary": "\"BITCOIN SURGES TO $103K: Altcoins Explode 10-20% as $800M in Shorts Get Wiped Out; US-UK Trade Deal and ETF Frenzy Fuel Buying Spree\""
    },
    {
      "original": "https://cryptopanic.com/news/21681900/German-Authorities-Seize-374M-in-Assets-from-Shuttered-Crypto-Exchange-eXch?mtm_campaign=API-OFA",
      "resolved": "https://decrypt.co/318765/german-authorities-seize-37-4m-in-assets-from-shuttered-crypto-exchange-exch",
      "title": "Germany Cracks Down on Notorious Crypto Exchange, Seizes $37.4M in Assets",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div><div><h4 color=\"#333\">In brief</h4><ul>\n<li>German prosecutors have announced the seizure of $37.4M (€34M) in cryptocurrency and hardware from eXch.</li>\n<li>The exchange allegedly facilitated money laundering from the Bybit hack and other significant thefts.</li>\n<li>On-chain investigators have accused eXch of processing \"tens of millions of dollars\" in stolen assets.</li>\n</ul></div><p>German authorities have seized servers and cryptocurrency valued at $37.4 million (€34 million) from eXch, a crypto exchange that prosecutors say operated without proper licenses and facilitated money laundering for North Korean threat actors linked to the Bybit hack in February.</p><p>Germany's Federal Criminal Police Office, the Bundeskriminalamt (BKA) issued a <a href=\"https://www.presseportal.de/blaulicht/pm/7/6029813\" target=\"_blank\" rel=\"nofollow external noopener\">statement</a> on Friday alleging the platform processed transactions without implementing proper anti-money laundering controls, making it an attractive option for criminals seeking to obscure stolen funds.</p><div><article><div><h2><a href=\"https://decrypt.co/315331/crypto-exchange-exch-shutting-down-following-links-to-lazarus-bybit-hack\">Crypto Exchange eXch Shutting Down Following Links to Lazarus, Bybit Hack</a></h2><p>eXch crypto exchange will shut down operations on May 1 following links to the $1.4 billion Bybit hack and an \"active transatlantic operation,\" the team said Thursday.\neXch is a privacy-focused crypto exchange known for operating without typical KYC, or know-your-customer) requirementsThe closure comes amid mounting allegations that eXch was complicit in the $1.4 billion Bybit hack in February, allegedly facilitating money laundered by North Korea's Lazarus hacker ring.\nThe exchange cited an \"ac...</p></div></article></div><p>\"Crypto swapping is an essential component of the underground economy, used to conceal incriminated funds from illegal activities,\" Dr. Benjamin Krause, chief public prosecutor at the German Central Office for Combating Cybercrime (ZIT), said in a translation of the statement.</p><p>Those activities include \"hacking or trading in stolen payment card data,\" and makes them \"available to perpetrators,\" Krause explained.</p><p>The confiscated items include crypto holdings, server hardware, and other types of digital infrastructure. The defunct exchange's services were \"accessible on both the clearnet and the darknet,\" and were advertised on \"platforms of the criminal underground economy,\" authorities noted.</p><p>These developments come as Germany is slated to participate in the <a href=\"https://decrypt.co/318518/g7-discuss-crypto-hacks-tackle-north-korean-issue\" target=\"_blank\">G7 summit</a>, where North Korea's crypto hacks would reportedly be discussed.</p><p>The exchange announced its <a href=\"https://decrypt.co/315331/crypto-exchange-exch-shutting-down-following-links-to-lazarus-bybit-hack\" target=\"_blank\">closure</a> last month after connections to multiple crypto thefts were revealed. However, blockchain analytics firm TRM Labs claimed it <a href=\"https://www.trmlabs.com/resources/blog/exch-remains-active-despite-shutdown-how-the-bybit-hack-linked-exchange-continues-to-enable-laundering-of-csam-funds\" target=\"_blank\" rel=\"nofollow external noopener\">continued to operate</a>.</p><div><article><div><h2><a href=\"https://decrypt.co/318518/g7-discuss-crypto-hacks-tackle-north-korean-issue\">G7 to Discuss Crypto Hacks, Tackle North Korean Issue: Report</a></h2><p>Leaders from the Group of Seven countries are reportedly looking to discuss how the numerous crypto hacks and malicious cyber activities that North Korea has engaged in for years could be addressed and mitigated.\nDiscussions will likely center around mounting geopolitical concerns and trade tensions between the U.S. and the G7's other member countries, according to an initial report from Bloomberg citing sources with knowledge of the summit's plans.\nNorth Korea's actions have been characterized...</p></div></article></div><h2 color=\"#333\">Lazarus links</h2><p>The now-defunct crypto exchange was used \"to launder hundreds of millions from the Bybit hack, Multisig hack, FixedFloat exploit, $243M Genesis Creditor theft,\" pseudonymous blockchain investigator ZachXBT <a href=\"https://t.me/investigations/249\" target=\"_blank\">reported</a> in Investigations, their Telegram channel.</p><p>eXch was also involved in \"countless phishing drainer services over the past few years with refusal to block addresses and freeze orders,\" ZachXBT claimed.</p><p>In February, eXch faced mounting scrutiny after blockchain analytics firm Elliptic <a href=\"https://decrypt.co/307430/bybit-funds-on-the-move-could-be-headed-for-bitcoin-mixers-next-elliptic\" target=\"_blank\">linked</a> it to North Korea's notorious <a href=\"https://decrypt.co/312561/north-koreas-hacking-ops-lazarus-group-paradigm\" target=\"_blank\">Lazarus Group</a> and their involvement in the <a href=\"https://decrypt.co/307215/ethereum-bitcoin-fall-bybit-confirms-hack\" target=\"_blank\">Bybit hack</a> that resulted in over $1.4 billion in stolen funds.</p><p>Elliptic and others, including ZachXBT, alleged eXch of processing \"tens of millions of dollars\" in stolen assets from the hack despite Bybit's requests to block it.</p><p>A purported email response from eXch, <a href=\"https://twitter.com/langeriuseth/status/1893608776357265677\" target=\"_blank\">archived on X</a> and cited by Elliptic, claims the exchange chose not to acknowledge Bybit's requests.</p><div><blockquote>\n<p lang=\"en\" dir=\"ltr\">5000 ETH stolen in Bybit hack is reportedly being laundered through eXch (a centralized mixer) and converted to Bitcoin via Chainflip. In response, Bybit requested eXch to block the funds and track their movement. However, eXch made this request public and refused to cooperate.… <a href=\"https://t.co/i2DlAsm3Bi\" data-wpel-link=\"internal\">pic.twitter.com/i2DlAsm3Bi</a></p>\n<p>— LANGERIUS (@langeriuseth) <a href=\"https://twitter.com/langeriuseth/status/1893608776357265677?ref_src=twsrc%5Etfw\" data-wpel-link=\"internal\">February 23, 2025</a></p></blockquote></div><p>At the time, eXch acknowledged in a statement to <i>Decrypt</i> that it did receive a request from Bybit to blacklist some addresses, though those were \"a minor part of the total amount,\" eXch CEO Johann Roberts told <i>Decrypt</i> at the time.</p><p><i>Decrypt</i> has reached out to eXch for comment on the German authorities' actions and will update this article should we receive a response.</p><div><h3>Daily Debrief<!-- --> Newsletter</h3><p>Start every day with the top news stories right now, plus original features, a podcast, videos and more.</p></div></div></div>",
      "image": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2025/05/bitcoin-chain-gID_7.jpg",
      "summary": "German authorities seized $37.4M in cryptocurrency from eXch, alleging it laundered stolen assets from North Korea's Lazarus group hacks, including the Bybit heist."
    },
    {
      "original": "https://cryptopanic.com/news/21681855/Senator-Tim-Scott-slams-partisan-politics-for-failed-stablecoin-bill?mtm_campaign=API-OFA",
      "resolved": "https://cointelegraph.com/news/senator-tim-scott-blames-politics-for-failed-stablecoin-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "title": "Partisan Politics Dampen Hopes for Stablecoin Legislation",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div data-v-60373258=\"\"><p>Senate Banking Committee Chairman Tim Scott blamed the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act’s failure on partisan politics during a Senate speech on May 8.</p><p>Scott <a data-ct-non-breakable=\"null\" href=\"https://www.youtube.com/watch?v=EqgYgx4kLPc&amp;sttick=0\" rel=\"nofollow noopener\" target=\"_blank\" text=\"null\" title=\"https://www.youtube.com/watch?v=EqgYgx4kLPc&amp;sttick=0\">said</a> the vote, which <a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/us-genius-stablecoin-act-fails-to-pass-cloture-by-to-vote\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/us-genius-stablecoin-act-fails-to-pass-cloture-by-to-vote\">failed to reach cloture in the Senate</a>, was expected to mark a step toward greater affordability and innovation. Instead, he said, political divisions took precedence.  </p><p>“Instead, we witnessed a disappointing display of political gamesmanship that puts partisan politics above policy, and obstruction above innovation,“ Scott said.</p><p>The bill had previously undergone multiple amendments to address concerns raised by Democrats, including stricter requirements for stablecoin issuers and further provisions for Anti-Money Laundering.</p><p><em><strong>Related: </strong></em><a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/donald-trump-xrp-crypto-reserve-trick\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/donald-trump-xrp-crypto-reserve-trick\"><em><strong>Trump tricked into pushing XRP for crypto reserve: Report</strong></em></a></p><h2>Scott criticizes last-minute opposition</h2><p>Scott, a South Carolina Republican, said that “the GENIUS Act was a bipartisan achievement at the Banking Committee.” By working on it, he claimed those involved “made the decision to make America's economy safer and cheaper for the American people.” Still, in his view, Democrats changed their minds when the “light and cameras were watching.”</p><p>Scott alleged that the shift was driven not by changes in the bill, but by efforts to deny President Donald Trump a legislative win:</p><blockquote>“It was a vote against President Trump and President Trump’s legislative agenda. It was a vote to stop President Trump from having a victory in the digital asset space.“</blockquote><p><em><strong>Related: </strong></em><a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/digital-asset-hearing-objection-donald-trump-crypto-corruption\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/digital-asset-hearing-objection-donald-trump-crypto-corruption\"><em><strong>Democrat lawmakers object to hearing, citing ‘Trump’s crypto corruption’</strong></em></a></p><h2>Democrats cite corruption concerns</h2><p><img src=\"https://images.cointelegraph.com/images/373_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9hNGFkNDk1ZmMwNGJkOTdmNzE2NDlhNDhkNjAwM2QwMC5wbmc=.png\"></p><p>Massachusetts Senator Elizabeth <a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/trump-s-stablecoin-rises-due-to-shady-crypto-deal-with-uae-senator-warren\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/trump-s-stablecoin-rises-due-to-shady-crypto-deal-with-uae-senator-warren\">Warren, a leading voice on crypto regulation, raised concerns</a> that the Trump family-linked stablecoin, USD1, surged in market value due to a “shady crypto deal with the United Arab Emirates.”</p><p>“The Senate shouldn’t pass a crypto bill this week to facilitate this kind of corruption,“ she said.</p><p>On May 1, Abu Dhabi-based investment firm MGX&nbsp;used the Trump-linked stablecoin USD1 to <a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/eric-trump-usd1-used-2-b-mgx-investment-binance\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/eric-trump-usd1-used-2-b-mgx-investment-binance\">settle a $2 billion investment in Binance</a>. According to CoinMarketCap&nbsp;<a data-ct-non-breakable=\"null\" href=\"https://coinmarketcap.com/currencies/usd1/\" rel=\"null\" target=\"null\" text=\"null\" title=\"https://coinmarketcap.com/currencies/usd1/\">data</a>, the stablecoin’s market cap shot up from under $137 million on May 1 to nearly $2.13 billion on May 2.</p><figure><img alt=\"\" src=\"https://s3.cointelegraph.com/uploads/2025-05/0196b4af-1614-7a10-9121-91bbcebc1196\" title=\"\"><figcaption><em>USD1’s Market Capitalization. Source:&nbsp;</em><a data-ct-non-breakable=\"null\" href=\"https://coinmarketcap.com/currencies/usd1/\" rel=\"null\" target=\"null\" text=\"null\" title=\"https://coinmarketcap.com/currencies/usd1/\"><em>CoinMarketCap</em></a></figcaption></figure><p>Democrats voiced concerns around Trump’s crypto-related activities and sponsored multiple bills to address those concerns. Four of the five pro-crypto Democrats who passed the GENIUS Act in the Senate Banking Committee <a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/us-stablecoin-bill-loses-democratic-support-trump-corruption-concerns\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/us-stablecoin-bill-loses-democratic-support-trump-corruption-concerns\">signed their names</a> to a statement on May 3, saying that they do not feel comfortable with the direction stablecoin legislation is taking. </p><p>While the letter did not mention Trump directly, Representative Maxine Waters was more explicit in her opposition.</p><p>“If there is no effort to block the President of the United States of America from owning his stablecoin business [...] I will never be able to agree on supporting this bill, and I would ask other members not to be enablers,” Waters said.</p><h2>Democrats propose stricter crypto laws</h2><p>Democrats also recently sponsored the Modern Emoluments and Malfeasance Enforcement Act, or the MEME Act, to prevent federal officials from <a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/news/us-senator-proposes-bill-would-prevent-trump-from-profiting-from-memecoins\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/news/us-senator-proposes-bill-would-prevent-trump-from-profiting-from-memecoins\">profiting from memecoins</a>. US Senator Jeff Merkley and Senate Minority Leader Chuck Schumer also <a data-ct-non-breakable=\"null\" href=\"https://www.merkley.senate.gov/wp-content/uploads/End-Crypto-Corruption-Act.pdf\" rel=\"nofollow noopener\" target=\"_blank\" text=\"null\" title=\"https://www.merkley.senate.gov/wp-content/uploads/End-Crypto-Corruption-Act.pdf\">introduced</a> the End Crypto Corruption Act earlier this week.</p><p>The End Crypto Corruption Act would ban the president, vice president, senior executive branch officials, members of Congress, and their immediate families from financially benefiting from issuing, endorsing or sponsoring crypto assets, such as memecoins and stablecoins.</p><p>In a statement <a data-ct-non-breakable=\"null\" href=\"https://www.merkley.senate.gov/merkley-and-schumer-lead-the-charge-to-end-crypto-corruption-by-trump-other-elected-officials/\" rel=\"nofollow noopener\" target=\"_blank\" text=\"null\" title=\"https://www.merkley.senate.gov/merkley-and-schumer-lead-the-charge-to-end-crypto-corruption-by-trump-other-elected-officials/\">published</a> on Merkley’s website, he said that “people who wish to cultivate influence with the president can enrich him personally by buying cryptocurrency he owns or controls.”</p><p>“This is a profoundly corrupt scheme. It endangers our national security and erodes public trust in government. Let’s end this corruption immediately,” Merkley added.</p><div><p>In a <a data-ct-non-breakable=\"null\" href=\"https://www.cbsnews.com/news/senate-democrats-genius-act-stablecoin-crypto-bill-trump/\" rel=\"nofollow noopener\" target=\"_blank\" text=\"null\" title=\"https://www.cbsnews.com/news/senate-democrats-genius-act-stablecoin-crypto-bill-trump/\">statement</a> to CBS News, Warren echoed that sentiment, saying that both Democrats in favor and opposed to the GENIUS Act “agree that green-lighting Donald Trump’s corrupt stablecoin deals is wrong.”</p><p>“The GENIUS Act will simply facilitate Trump’s crypto corruption,” Warren claimed.</p></div><p><em><strong>Magazine: </strong></em><a data-ct-non-breakable=\"null\" href=\"https://cointelegraph.com/magazine/trumps-crypto-insider-trading-conflict-of-interest-concerns/\" rel=\"\" target=\"_self\" text=\"null\" title=\"https://cointelegraph.com/magazine/trumps-crypto-insider-trading-conflict-of-interest-concerns/\"><em><strong>Trump’s crypto ventures raise conflict of interest, insider trading questions</strong></em></a></p><p><img src=\"https://images.cointelegraph.com/images/373_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9hNGFkNDk1ZmMwNGJkOTdmNzE2NDlhNDhkNjAwM2QwMC5wbmc=.png\"></p><form novalidate=\"novalidate\" data-ct-widget=\"newsletter-subscription-form\"><p>Explore more articles like this</p><p>Subscribe to our Crypto Biz newsletter</p><p>Weekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday</p><div><p><img src=\"https://s3.cointelegraph.com/storage/uploads/view/9eae0e798df83a1530d957f23cb4573e.svg\" decoding=\"async\" fetchpriority=\"high\" loading=\"lazy\"></p></div><p>By subscribing, you agree to our <a target=\"_blank\" href=\"https://cointelegraph.com/terms-and-privacy\">Terms of Services and Privacy Policy</a></p><!----></form>\n\n\n</div></div>",
      "image": null,
      "summary": "Crypto legislation in the US Senate fails as partisan politics takes over."
    },
    {
      "original": "https://cryptopanic.com/news/21681506/Pi-Network-Whales-Buy-14M-Worth-of-Pi-from-OKX-Big-Exchange-Listing-Ahead?mtm_campaign=API-OFA",
      "resolved": "https://coinpedia.org/news/pi-network-whales-buy-14m-worth-of-pi-from-okx-big-exchange-listing-ahead/",
      "title": "Pi Whales Strike Big, Buying $14M Worth of Pi on OKX - Exchange Listing Imminent",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div role=\"main\" id=\"main-content-row\"><article id=\"the-post\" data-post-url=\"https://coinpedia.org/news/pi-network-whales-buy-14m-worth-of-pi-from-okx-big-exchange-listing-ahead/\" data-post-title=\"Pi Network Whales Buy $14M Worth of Pi from OKX – Big Exchange Listing Ahead?\" data-post-edit=\"https://coinpedia.org/wp-admin/post.php?post=452952&amp;action=edit\"><!-- .entry-header-outer /--><div><figure><img width=\"1200\" height=\"628\" src=\"https://image.coinpedia.org/wp-content/uploads/2025/05/05180046/Why-Pi-Network-Listing-on-CEX-Is-Taking-Time.webp\" alt=\"Why Pi Network Listing on CEX Is Taking Time\" data-main-img=\"1\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://image.coinpedia.org/wp-content/uploads/2025/05/05180046/Why-Pi-Network-Listing-on-CEX-Is-Taking-Time.webp 1200w, https://image.coinpedia.org/wp-content/uploads/2025/05/05180046/Why-Pi-Network-Listing-on-CEX-Is-Taking-Time-300x157.webp 300w, https://image.coinpedia.org/wp-content/uploads/2025/05/05180046/Why-Pi-Network-Listing-on-CEX-Is-Taking-Time-1024x536.webp 1024w, https://image.coinpedia.org/wp-content/uploads/2025/05/05180046/Why-Pi-Network-Listing-on-CEX-Is-Taking-Time-768x402.webp 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"></figure></div><div><p><strong>crypto whales purchased 20 million Pi Coins</strong> from <strong>centralized exchange OKX</strong>, valued at a massive <strong>$14 million</strong>. The tokens were transferred off the exchange into private wallets, suggesting strategic accumulation amid growing market interest in Pi Network.</p><p>This isn’t an isolated event. These kinds of daily buybacks are becoming increasingly common, raising speculation that whales are intentionally creating a <strong>supply crunch on CEXs</strong>—a move that could spark a future price surge.</p><p>As per blockchain data, the tokens were moved into:</p><ul><li><strong>Hash:</strong> <code>793b257cac5768e2c4b10d11656bc4ecb9ea98de1f2015a6fccdd4fd8f96c57a</code></li><li><strong>Wallet 1:</strong><code>GBPHFQE7GFKIRTSXJVQ56TVCXH7LYLVQBCPGE22NJ3JQPBTDBWW2DURB</code></li><li><strong>Hash:</strong> <code>2b9489a818083fe2bbfb6a2069cb3454af2891e14da76b2f5717bfd5a5ea38f6</code></li><li><strong>Wallet 2:</strong><code>GBAD3GDK7RKAMPLM2FELL3OI65QUCD45HAMMRKX2HZ6WEMV4EP2ORVTH</code></li></ul><h2 id=\"h-5-billion-pi-coin-supply-spike-sparks-listing-rumors\">5 Billion Pi coin Supply Spike Sparks Listing Rumors</h2><p>This accumulation comes just hours after a <strong>sudden 5 billion spike</strong> in Pi Coin’s <strong>circulating supply</strong>, which jumped from <strong>7 billion to 12 billion</strong>. Yet, exchange wallet balances haven’t changed—fueling speculation.</p><p>According to <strong><a href=\"https://x.com/pibartermall/status/1920797075035283736\">Pi Barter Mall</a></strong>, this sudden rise may stem from a <strong>5 billion Pi liquidity pool</strong> release, possibly <strong>in preparation for a major exchange listing</strong>. While official confirmation is pending, such activity hints at broader plans to introduce Pi Coin into deeper liquidity environments.</p><h2 id=\"h-pi-coin-price-prediction\">Pi Coin Price Prediction</h2><figure><img decoding=\"async\" width=\"1024\" height=\"371\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201024%20371'%3E%3C/svg%3E\" alt=\"\" data-lazy-srcset=\"https://image.coinpedia.org/wp-content/uploads/2025/05/09173023/image-20-1024x371.png 1024w, https://image.coinpedia.org/wp-content/uploads/2025/05/09173023/image-20-300x109.png 300w, https://image.coinpedia.org/wp-content/uploads/2025/05/09173023/image-20-768x278.png 768w, https://image.coinpedia.org/wp-content/uploads/2025/05/09173023/image-20-1536x557.png 1536w, https://image.coinpedia.org/wp-content/uploads/2025/05/09173023/image-20-2048x742.png 2048w\" data-lazy-sizes=\"(max-width: 1024px) 100vw, 1024px\" data-lazy-src=\"https://image.coinpedia.org/wp-content/uploads/2025/05/09173023/image-20-1024x371.png\"></figure><p>Pi Coin is showing notable strength on the <a href=\"https://www.tradingview.com/chart/PIUSDT.P/USSeI9Fp-PI-coin/\">technical charts</a>. Following a sharp price rise and surge in trading volume, Pi Coin is now consolidating within $0.58 and $0.59.</p><p>Several indicators are aligning to suggest a bullish breakout for Pi Coin. The RSI is forming a golden cross on both the 4-hour and daily charts, signaling a possible continuation of the upward trend. At the same time, the stochastic RSI appears to be bottoming out, another indicator pointing to a potential reversal to the upside.</p><p>Pi Coin is forming the “C” leg of the butterfly pattern, expected around the $0.5603 level. However, since the price is currently showing strength at the golden pocket of $0.5833, it is likely to move higher from here.</p><h3 id=\"h-strategy-for-traders\">Strategy for Traders:</h3><p><strong>Targets:</strong> $0.576, $0.614, $0.6685, $0.702</p><p><strong>Entries:</strong></p><ul><li>$0.5833 (10%)</li><li>$0.5606 (30%)</li><li>$0.5496 (60%)</li></ul><p><strong>Stop-Loss:</strong> $0.54</p></div><!-- .entry-content /--><!-- .toggle-post-content -->  <!-- .share-buttons /-->  </article><!-- #the-post /--><div><h2>We'd Love to Hear Your Thoughts on This Article!</h2><div><h4>Was this writing helpful?</h4></div></div>   <!-- .post-components /--></div></div>",
      "image": "http://image.coinpedia.org/wp-content/uploads/2025/05/05180046/Why-Pi-Network-Listing-on-CEX-Is-Taking-Time.webp",
      "summary": "Crypto whales just bought 14 million Pi Coins from OKX, valued at $14 million - and it's not the only big purchase of the day. This kind of accumulation suggests a supply crunch on CEXs is coming, which could send Pi Coin prices soaring."
    },
    {
      "original": "https://cryptopanic.com/news/21681466/Cardano-outperforms-Apple-Nvidia-Tesla-and-Microsoft-in-last-12-months?mtm_campaign=API-OFA",
      "resolved": "https://finbold.com/cardano-outperforms-apple-nvidia-tesla-and-microsoft-in-last-12-months/",
      "title": "Cardano Crushes Tech Giants, Skyrockets by 71% in Last Year",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n    <div>\n<div>\n\n<p><h3 id=\"summary\">Summary:</h3></p>\n</div>\n<div><p>⚈ Cardano surged 71.39% in 12 months, outperforming Apple, Nvidia, Microsoft, and Tesla</p><p>⚈ ADA also beat Bitcoin and Ethereum, despite recent rallies in both assets</p><p>⚈ Only XRP outpaced Cardano among major cryptos, with a 320.92% yearly gain</p></div>\n</div>\n\n\n\n<p>Thanks to a 9.05% 24-hour rally to $0.79, <a href=\"https://finbold.com/guide/how-to-buy-cardano/\">Cardano’s</a> (<a href=\"https://finbold.com/cryptocurrency/cardano\">ADA</a>) price performance finally matches the <a href=\"https://finbold.com/cardano-blockchain-development-explodes-in-2025/\">activity explosion</a> on its <a href=\"https://finbold.com/guide/blockchain-developer/\">blockchain</a> that saw a surge in active addresses and smart contracts in 2025.</p>\n\n\n\n<p>Despite the reputation Cardano’s middling fortunes in the <a href=\"https://finbold.com/cryptocurrencies/\">cryptocurrency market</a> have given ADA, the token has significantly outperformed the majority of the most popular investments in the equity markets over the last 12 months.</p>\n\n\n\n<figure><img decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXcNYAKvX1S5o_VGoteyTIXjKOUPimu2dgpKXaKhh1VSbjKAL7JDo9barrZctHP4gYBE6Nw96h3me5sigHOIfrAK97fKuTNwq-XCYtfd7h8N2Qhs7s1duYq_FxtLmQMci-Ara36BxQ?key=E4J0m4V741YgF_nuZ6waMQ\" alt=\"Cardano's performance in the last 12 months.\"><figcaption>ADA 1-year price chart. Source: Finbold</figcaption></figure>\n\n\n\n<h2 id=\"h-cardano-outperformed-most-popular-stocks-in-the-last-year\">Cardano outperformed most popular stocks in the last year</h2>\n\n\n\n<p>Between May 9, 2024, and May 9, 2025, Cardano rallied 71.39% from $0.46 to $0.79. Within the same time frame, one of the most popular <a href=\"https://finbold.com/stocks/\">stocks</a> in the world, <a href=\"https://finbold.com/guide/how-to-buy-nvidia-stock/\">Nvidia</a> (NASDAQ: <a href=\"https://finbold.com/stock/nvidia-stock-nvda/\">NVDA</a>), rose 32.25% to $117.37.</p>\n\n\n\n<figure><img decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdZtLBmiFIet3cD4lu5sdMP-HHH7GBriUfF5W4kMZ30QrWzKKQ75yUOy_FgygAhslg9oUNAjIcNK5XsiIvF6tuzY4IZ7-6puupqn8ntOfBFgxqSoWZhtYSrXbQ-zS9eQ1mJ0lIppg?key=E4J0m4V741YgF_nuZ6waMQ\" alt=\"Nvidia's performance in the last 12 months.\"><figcaption>NVDA stock 1-year price chart. Source: Google</figcaption></figure>\n\n\n\n<p>ADA has also outperformed the two other contenders for the spot of the biggest company in the world by market capitalization: <a href=\"https://finbold.com/guide/how-to-buy-microsoft-stock/\">Microsoft</a> (NASDAQ: <a href=\"https://finbold.com/stock/microsoft-msft/\">MSFT</a>) and <a href=\"https://finbold.com/guide/how-to-buy-apple-stock/\">Apple</a> (NASDAQ: <a href=\"https://finbold.com/stock/apple-aapl/\">AAPL</a>).</p>\n\n\n\n<p>In the last 12 months, MSFT stock rallied 6.42% to $438.78, and AAPL shares climbed 7.33% to $198.09.</p>\n\n\n\n<figure><img decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXd5YsmYVmXosVEHZeFOKU2UUdCVLTmAvpEasYtqGY8aqROEuL3S5-3iTQpMN2n4G36KnsaNwGu3jeMIGp0p8H4R88LyheXLjr3seYti5GiMC-GQn2fKxye_oJ3OTaUxNWu7VbmE7g?key=E4J0m4V741YgF_nuZ6waMQ\" alt=\"Microsoft and Apple's performance in the last 12 months.\"><figcaption>MSFT and AAPL stock 1-year price chart. Source: Finbold</figcaption></figure>\n\n\n\n<p>Interestingly, the best-performing popular firm relative to Cardano’s 52-week rally proved to be <a href=\"https://finbold.com/guide/how-to-buy-tesla-stock/\">Tesla</a> (NASDAQ: <a href=\"https://finbold.com/stock/tesla-tsla/\">TSLA</a>), despite TSLA shares’ sharp drop in 2025 and the electric vehicle (<a href=\"https://finbold.com/guide/top-5-ev-stocks-to-buy/\">EV</a>) maker’s abysmal sales in the first quarter (Q1) of the year. <a href=\"https://finbold.com/guide/how-much-money-does-elon-musk-make-a-second/\">Elon Musk’s</a> car company rose 66.88% in the last year—almost as much as Cardano—and is, at press time, changing hands at $286.99.</p>\n\n\n\n<figure><img decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXe-PCeyOmBkP1NYT8blFpEec0aLhFNDPQ34F9g7_uJnT0ra3QBIkDtZYYGUnhrcuCUXX0kco_d5lJUjmsq6ezbWzFgPPjM7LCptU_YDMHhpfKKBXBcq55Q3LnZ_IWqRwxAZoXcC5Q?key=E4J0m4V741YgF_nuZ6waMQ\" alt=\"Tesla's performance in the last 12 months.\"><figcaption>TSLA stock 1-year price chart. Source: Finbold</figcaption></figure>\n\n\n\n<h2 id=\"h-ada-beats-most-major-digital-assets-in-the-crypto-market\">ADA beats most major digital assets in the crypto market</h2>\n\n\n\n<p>Perhaps surprisingly, given the relative lack of interest in ADA in recent months and the fact that the token’s latest rally came as part of a wider digital assets uptrend, it also outperformed many of its biggest peers.</p>\n\n\n\n<p>Despite <a href=\"https://finbold.com/guide/fastest-way-to-buy-bitcoin/\">Bitcoin</a> (<a href=\"https://finbold.com/cryptocurrency/bitcoin/\">BTC</a>) soaring <a href=\"https://finbold.com/nearly-40000-bitcoin-millionaires-emerge-in-a-month/\">above $100,000</a> in the last 24 hours, its 12-month rise came slightly short of Cardano’s as it amounted to 63.60%. The comparison with <a href=\"https://finbold.com/guide/fastest-way-to-buy-ethereum/\">Ethereum</a> (<a href=\"https://finbold.com/cryptocurrency/ethereum/\">ETH</a>) is even more lopsided, even once the latest <a href=\"https://finbold.com/ethereum-soars-26-in-a-day-adding-66-billion/\">26% one-day rally</a> is accounted for, as ETH is, in fact, 22.73% down since May 9, 2024.</p>\n\n\n\n<figure><img decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXe0e_ET9qll-75O6c2lIMegUvp8quUNJiS-WeHGemOFVm2v7rRimb1PhwsI3frzKs_K9Tl04ILdS-L0xwrucY3sVvnHP84uBGqtbNAKTxCj4HP5-mcVZWrUUNa_539jDO8IMj2j?key=E4J0m4V741YgF_nuZ6waMQ\" alt=\"XRP, Bitcoin, and Ethereum's performance in the last 12 months.\"><figcaption>XRP, BTC, and ETH  1-year price chart. Source: Finbold</figcaption></figure>\n\n\n\n<p><a href=\"https://finbold.com/cryptocurrency/ripple/\">XRP</a> is, on the other hand, one of the few popular assets that decisively outperformed ADA in the 12-month time frame. Its powerful rally on <a href=\"https://finbold.com/guide/donald-trump-net-worth/\">Donald Trump’s</a> re-election ensured it is 320.92% in the green in the last 52 weeks.</p>  </div></div>",
      "image": "https://assets.finbold.com/uploads/2025/05/Cardano-outperforms-Apple-Nvidia-Tesla-and-Microsoft-in-last-12-months.jpg",
      "summary": "Cardano's ADA surged 71.39% over the past year, outperforming big names like Apple, Nvidia, Microsoft and Tesla, as well as Bitcoin and Ethereum - with only XRP beating it among major cryptos."
    },
    {
      "original": "https://cryptopanic.com/news/21681336/Jeffy-Yu-Thought-Dead-Discovered-Alive-at-Parents-Home-After-LLJEFFY-Rally?mtm_campaign=API-OFA",
      "resolved": "https://crypto-economy.com/jeffy-yu-thought-dead-discovered-alive-at-parents-home-after-lljeffy-rally/",
      "title": "Crypto Community Brought to Tears as Famed \"Dead\" Crypto Co-Founder Jeffy Yu Found Alive and Well",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div data-id=\"138652c\" data-element_type=\"widget\" data-widget_type=\"theme-post-content.default\">\n\t\t\t<p><span data-preserver-spaces=\"true\">TL;DR</span></p>\n<ul>\n<li><strong><span data-preserver-spaces=\"true\">Staged Demise:</span></strong><span data-preserver-spaces=\"true\"> Jeffy Yu, co-founder of Zerebro, faked his death during a livestream, shocking the crypto community before being found alive at his parents’ home.</span></li>\n<li><strong><span data-preserver-spaces=\"true\">Meme Coin Mayhem:</span></strong><span data-preserver-spaces=\"true\"> The hoax sent his meme coin $LLJEFFY skyrocketing over 2,000%, briefly reaching a market cap close to $105 million.</span></li>\n<li><strong><span data-preserver-spaces=\"true\">Controversial Aftermath:</span></strong><span data-preserver-spaces=\"true\"><span data-preserver-spaces=\"true\"> The stunt, intended as a publicity move against internet fame pressures, has sparked heated debate over market manipulation and investor trust.</span></span><br>\n<hr>\n</li>\n</ul>\n<p><strong><span data-preserver-spaces=\"true\">Jeffy Yu</span></strong><span data-preserver-spaces=\"true\">, co-founder of Zerebro, </span><strong><span data-preserver-spaces=\"true\">was </span><a href=\"https://sfstandard.com/2025/05/08/jeffy-yu-zerebro-fake-death/\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\">recently</span></a><span data-preserver-spaces=\"true\"> found alive at his parents’ residence after orchestrating his death during a livestream</span></strong><span data-preserver-spaces=\"true\">. The elaborate hoax, featuring a chilling live broadcast and a quickly shared obituary, sent ripples of shock throughout the </span><a href=\"https://crypto-economy.com/what-are-cryptocurrencies-and-which-are-the-best-to-invest-in/\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\">digital asset</span></a><span data-preserver-spaces=\"true\"> community.</span><span id=\"more-185513\"></span></p>\n<p><strong><span data-preserver-spaces=\"true\">In the wake of the “suicide,” his self-launched meme coin, $LLJEFFY, experienced an unprecedented rally, surging over 2,000%</span></strong><span data-preserver-spaces=\"true\"> and reaching a market cap of nearly </span><strong><span data-preserver-spaces=\"true\">$105 million</span></strong><span data-preserver-spaces=\"true\"> at its peak. </span><strong><span data-preserver-spaces=\"true\">Blockchain analysts noted a flurry of transactions</span></strong><span data-preserver-spaces=\"true\">, with significant amounts of crypto moving between wallets linked to Yu, fueling suspicion that the entire tragedy was merely an elaborate stunt.</span></p>\n<h2><span data-preserver-spaces=\"true\">Discovery and Fallout</span></h2>\n<p><strong><span data-preserver-spaces=\"true\">The dramatic narrative took an unexpected turn when reporters from a local outlet tracked Jeffy Yu down at his parents’ home</span></strong><span data-preserver-spaces=\"true\"> in Crocker-Amazon. Rather than finding a fallen visionary, they encountered a visibly shaken and agitated Jeffy Yu in flip-flops, who admitted he had been doxxed and harassed. </span><strong><em><span data-preserver-spaces=\"true\">“I’ve been doxxed. I’ve been harassed,”</span></em></strong> <strong><span data-preserver-spaces=\"true\">he explained</span></strong><span data-preserver-spaces=\"true\">, his voice tinged with disbelief at the chaotic fallout. </span></p>\n<p><span data-preserver-spaces=\"true\">The revelation that he was very much alive has sent ripples through the community, forcing fans and investors alike to question the ethics of orchestrating such high-stakes stunts. </span><strong><span data-preserver-spaces=\"true\">His elaborate ruse, it appears, was meant to serve as both a publicity stunt and an outcry against the relentless pressures of internet fame</span></strong><span data-preserver-spaces=\"true\">, though its consequences have proven to be far more disruptive than anticipated.</span></p>\n<p><picture fetchpriority=\"high\" decoding=\"async\">\n<source type=\"image/webp\" srcset=\"https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYu.jpg.webp 825w, https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYu-300x109.jpg.webp 300w, https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYu-768x279.jpg.webp 768w\" sizes=\"(max-width: 825px) 100vw, 825px\">\n<img fetchpriority=\"high\" decoding=\"async\" src=\"https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYu.jpg\" alt=\"Jeffy Yu, Thought Dead, Discovered Alive at Parents’ Home After $LLJEFFY Rally\" width=\"825\" height=\"300\" srcset=\"https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYu.jpg 825w, https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYu-300x109.jpg 300w, https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYu-768x279.jpg 768w\" sizes=\"(max-width: 825px) 100vw, 825px\">\n</picture>\n</p>\n<h2><span data-preserver-spaces=\"true\">A Contentious Return and Uncertain Future</span></h2>\n<p><span data-preserver-spaces=\"true\">In the immediate aftermath, </span><strong><span data-preserver-spaces=\"true\">the $LLJEFFY token suffered a dramatic collapse as the market corrected itself, leaving many investors reeling from the manipulated surge</span></strong><span data-preserver-spaces=\"true\">. The incident has ignited fierce debate within the crypto community about the fine line between performance art and market manipulation.</span></p>\n<p><span data-preserver-spaces=\"true\">While some see Yu’s stunt as an audacious, if reckless, commentary on the volatility of </span><a href=\"https://crypto-economy.com/pepe/\" target=\"_blank\" rel=\"noopener\"><span data-preserver-spaces=\"true\">memecoins</span></a><span data-preserver-spaces=\"true\"> and digital stardom, others warn that such tactics undermine trust and destabilize the market. As Jeffy Yu now faces the real-world repercussions of his actions, the crypto world is left to ponder how far is too far in the pursuit of viral notoriety.</span></p>\n\t\t</div></div>",
      "image": "https://crypto-economy.com//wp-content/uploads/2025/05/JeffyYuFakeDeath.jpg",
      "summary": "Jeffy Yu, co-founder of Zerebro, faked his death during a livestream, shocking the crypto community, and his meme coin $LLJEFFY skyrocketed over 2,000% before collapsing, sparking heated debate over market manipulation."
    },
    {
      "original": "https://cryptopanic.com/news/21681504/Stripe-Launches-Stablecoin-Financial-Accounts-to-Bridge-TradeFi-and-Crypto?mtm_campaign=API-OFA",
      "resolved": "https://cryptodnes.bg/en/stripe-launches-stablecoin-financial-accounts-to-bridge-tradefi-and-crypto/",
      "title": "Stripe Unleashes The Crypto Bridge: Stablecoin Financial Accounts Are Here",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n\n                <p>Stripe, the global payments leader, has taken a major step into the world of stablecoins with the introduction of its new feature, Stablecoin Financial Accounts.</p><p>This service enables businesses to manage their funds in US dollar-backed stablecoins, bridging the gap between traditional finance and crypto channels. Available in 101 countries, it aims to help businesses navigate currency fluctuations, offering protection from inflation, especially in regions where economic instability is more pronounced.</p>\n<p>This service opens up significant opportunities for businesses in volatile markets. Stripe highlighted that entrepreneurs in countries with high inflation could benefit from using stablecoins as a buffer against rising costs while gaining seamless access to the global economy. This move also aligns with Stripe’s growing influence in the stablecoin space, as it supports companies looking to leverage digital currencies for better financial management.</p>\n<p>At launch, two key stablecoins are supported: USDC, backed by Circle, and USDB, a new stablecoin developed by Bridge, a company Stripe acquired earlier this year in a landmark $1.1 billion deal. This acquisition, Stripe’s largest to date, reflects its deepening commitment to stablecoin technology and digital assets.</p>\n\n\n<p>The integration of Bridge’s capabilities into Stripe’s offerings is a significant milestone, positioning the company as a leader in providing crypto-enabled payment solutions. Stripe’s latest product is expected to have a broad appeal, particularly among startups, freelancers, and businesses in areas where banking infrastructure is weak or inflation rates are high.</p>\n<p>Looking ahead, Stripe plans to expand its stablecoin support, offering more digital currencies in the future. This development is part of a broader trend where traditional fintech companies are increasingly adopting blockchain solutions to improve payment speed, reduce costs, and foster greater financial inclusion across the globe.</p>\n\n                \n                                <p dir=\"ltr\">\n                    <a href=\"https://t.me/cryptodnesen\" rel=\"nofollow\">\n                        <img src=\"https://cryptodnes.bg/en/wp-content/themes/cryptodnes/assets/images/telegram-en.jpg\" alt=\"Telegram\">\n                    </a>\n                </p>\n                                \n                <p><span>SHARE:</span>\n                    <span>\n                        \n                        \n\n                        <a href=\"https://telegram.me/share/url?url=https://cryptodnes.bg/en/stripe-launches-stablecoin-financial-accounts-to-bridge-tradefi-and-crypto/&amp;text=Stripe%20Launches%20Stablecoin%20Financial%20Accounts%20to%20Bridge%20TradeFi%20and%20Crypto\" target=\"_blank\" rel=\"nofollow\"><i></i></a>\n\n                    </span>\n\n                    <span>\n                        <span>0</span>\n                        <span>SHARES</span>\n                    </span>\n\n                </p>\n\n                </div></div>",
      "image": "https://cryptodnes.bg/en/wp-content/uploads/sites/2/2022/07/stripe.png",
      "summary": "Stripe is about to make your life easier with stablecoin accounts for businesses, bridging the gap between crypto and traditional finance."
    },
    {
      "original": "https://cryptopanic.com/news/21680884/344620-New-Bitcoin-Wallets-Mega-FOMO-Just-Entered-Market?mtm_campaign=API-OFA",
      "resolved": "https://u.today/344620-new-bitcoin-wallets-mega-fomo-just-entered-market",
      "title": "The Explosive Rise of 344,620 New Bitcoin Wallets: A Massive Market Frenzy Has Arrived",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div>\n                                                                <p><img src=\"https://u.today/sites/default/files/styles/736/public/2025-05/s7114.jpg\" alt=\"344,620 New Bitcoin Wallets, Mega FOMO Just Entered Market\">\n                                        \n\n\n                                        \n                                                                                                        </p>\n                                                                    <figcaption title=\"https://www.freepik.com/premium-ai-image/digital-wallet-technology-innovation-with-bitcoin-transaction_361056597.htm#fromView=image_search_similar&amp;page=1&amp;position=18&amp;uuid=930837ec-f0ef-41b3-aa47-61394d179cfc&amp;new_detail=true\">Cover image via <a href=\"https://www.freepik.com/premium-ai-image/digital-wallet-technology-innovation-with-bitcoin-transaction_361056597.htm#fromView=image_search_similar&amp;page=1&amp;position=18&amp;uuid=930837ec-f0ef-41b3-aa47-61394d179cfc&amp;new_detail=true\">www.freepik.com</a></figcaption>\n                                \n                                                                                                                                    <div>\n                                        <p>Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions.  We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.</p>\n                                    </div>\n\n                                                                                            </div><div>\n\n                                                                                        <p dir=\"ltr\"><a href=\"https://u.today/breaking-bitcoin-hits-100000-is-200000-possible-in-2025#google_vignette\">Bitcoin</a> (BTC) has gained over $4,000 in the last 48 hours and looks poised to appreciate more in its current breakout move. As BTC adoption soars, the development has triggered a Fear of Missing Out (FOMO) wave on the cryptocurrency market.</p> <h2>Bitcoin FOMO frenzy returns</h2><p dir=\"ltr\">Santiment, a market intelligence platform, <a rel=\"nofollow\" target=\"_blank\" href=\"https://x.com/santimentfeed/status/1920677308924297638\">noted</a> that 344,620 new wallets have been added to the blockchain since the surge in price began. This represents the number of new users that have created Bitcoin addresses as demand increases, looking to benefit from the gains.</p><div>\n                    <p>You Might Also Like</p>\n                    <div>\n                      <p><img src=\"https://u.today/sites/default/files/styles/300/public/2025-05/s7112.jpg\" width=\"300\" height=\"199\" alt=\"Title news\"></p>\n                      \n                    </div>\n                  </div><p dir=\"ltr\">Notably, as Bitcoin’s price surged, investors who previously stayed away from the market are now rushing in for possible swing trading profit-taking. This development generally fuels market activity and could drive prices up further.</p><p dir=\"ltr\">The rush to own a slice of Bitcoin is understandable given that the digital asset has not appreciated to this level since January.</p><p dir=\"ltr\">Remarkably, Bitcoin has not flipped the $100,000 psychological level since February 2025, leading some market participants to believe the BTC price will go down.</p><p dir=\"ltr\">However, the recent development has shocked many. As Santiment observed, “Crypto's top market cap asset has silenced bears, reaching a high of $103.8K for the first time since January.”</p><div><blockquote data-twitter-extracted-i1746793847062370346=\"true\"><p lang=\"en\" dir=\"ltr\">📈 Bitcoin's network saw 344,620 new wallets be created on its network as FOMO poured in. Crypto's top market cap asset has silenced bears, reaching a high of $103.8K for the first time since January. 👀 <a rel=\"nofollow\" target=\"_blank\" href=\"https://t.co/hai245lQJz\">pic.twitter.com/hai245lQJz</a></p>— Santiment (@santimentfeed) <a rel=\"nofollow\" target=\"_blank\" href=\"https://twitter.com/santimentfeed/status/1920677308924297638?ref_src=twsrc%5Etfw\">May 9, 2025</a></blockquote> </div><p dir=\"ltr\">Bitcoin performance has defied all bearish predictions and invalidated short-term negative outlooks on the asset.</p><h2>Market activity surges as confidence returns</h2><p dir=\"ltr\">As of press time, the Bitcoin price was <a rel=\"nofollow\" target=\"_blank\" href=\"https://coinmarketcap.com/currencies/bitcoin/\">exchanging</a> hands at $103,361.05, representing a 3.54% increase in the last 24 hours.</p><p dir=\"ltr\">Meanwhile, the FOMO has helped push trading volume up by a significant 34.15% to $72.99 billion, suggesting renewed confidence on the Bitcoin market.</p><p dir=\"ltr\">The upsurge of Bitcoin price could also trigger selling pressure. Notably, if investors who bought the asset in January before it crashed decide to offload to minimize loss, this could affect its upward movement.</p><div>\n                    <p>You Might Also Like</p>\n                    <div>\n                      <p><img src=\"https://u.today/sites/default/files/styles/300/public/2025-05/58149.jpg\" width=\"300\" height=\"199\" alt=\"Title news\"></p>\n                      \n                    </div>\n                  </div><p dir=\"ltr\">However, Changpeng Zhao, the former CEO of Binance, has advised holders not to&nbsp;<a href=\"https://u.today/binances-cz-offers-key-advice-to-bitcoin-panic-sellers\">panic sell</a>, as the coin has prospects.</p><p dir=\"ltr\">For his part, Billy Markus, the Dogecoin founder, remains unimpressed by BTC flipping $100,000. In a recent comment <a href=\"https://u.today/dogecoin-founder-breaks-silence-on-bitcoin-to-100000-price-move\">reported</a> by U.Today, a price spike that would set another all-time high might meet his approval.</p>\n            \n                                                                                            </div></div>",
      "image": "https://u.today/sites/default/files/styles/twitterwithoutlogo/public/2025-05/s7114.jpg",
      "summary": "Bitcoin smashes $100K, sparks FOMO frenzy and 344k new wallets. Will the momentum continue?"
    },
    {
      "original": "https://cryptopanic.com/news/21680609/Taiwan-Warned-of-Currency-Crisis-Lawmakers-Urge-Bitcoin-as-Nations-Digital-Gold?mtm_campaign=API-OFA",
      "resolved": "https://coinpedia.org/news/taiwan-warned-of-currency-crisis-lawmakers-urge-bitcoin-as-nations-digital-gold/",
      "title": "Taiwan Teeters on Currency Crisis – Politicians Push Bitcoin as Digital Lifeline",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div role=\"main\" id=\"main-content-row\"><article id=\"the-post\" data-post-url=\"https://coinpedia.org/news/taiwan-warned-of-currency-crisis-lawmakers-urge-bitcoin-as-nations-digital-gold/\" data-post-title=\"Taiwan Warned of Currency Crisis – Lawmakers Urge Bitcoin as Nation’s Digital Gold!\" data-post-edit=\"https://coinpedia.org/wp-admin/post.php?post=452951&amp;action=edit\"><!-- .entry-header-outer /--><div><figure><img width=\"1200\" height=\"628\" src=\"https://image.coinpedia.org/wp-content/uploads/2024/05/09173932/Taiwan-Introduces-4-New-Laws-to-Combat-Fraud-Dealing-with-Virtual-Asset-and-AML.webp\" alt=\"\" data-main-img=\"1\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://image.coinpedia.org/wp-content/uploads/2024/05/09173932/Taiwan-Introduces-4-New-Laws-to-Combat-Fraud-Dealing-with-Virtual-Asset-and-AML.webp 1200w, https://image.coinpedia.org/wp-content/uploads/2024/05/09173932/Taiwan-Introduces-4-New-Laws-to-Combat-Fraud-Dealing-with-Virtual-Asset-and-AML-300x157.webp 300w, https://image.coinpedia.org/wp-content/uploads/2024/05/09173932/Taiwan-Introduces-4-New-Laws-to-Combat-Fraud-Dealing-with-Virtual-Asset-and-AML-1024x536.webp 1024w, https://image.coinpedia.org/wp-content/uploads/2024/05/09173932/Taiwan-Introduces-4-New-Laws-to-Combat-Fraud-Dealing-with-Virtual-Asset-and-AML-768x402.webp 768w, https://image.coinpedia.org/wp-content/uploads/2024/05/09173932/Taiwan-Introduces-4-New-Laws-to-Combat-Fraud-Dealing-with-Virtual-Asset-and-AML-150x79.webp 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"></figure></div><div><p>As Taiwan deals with growing global inflation and geopolitical risks, lawmakers are now raising a bold question: Is it time to treat Bitcoin as part of the nation’s financial defense plan?</p><p>While the idea is gaining support from experts and former officials. Could Bitcoin help protect Taiwan’s economy in uncertain times?&nbsp;</p><p>Let’s find it out!</p><p>Taiwan’s economy, which is heavily built on exports, is highly exposed to foreign markets. This has made the value of the New Taiwan Dollar change a lot lately. As an export-driven country, Taiwan is highly affected by global inflation and rising tensions between major countries.&nbsp;</p><figure><div><blockquote data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Taiwan legislator Ko Ju-Chun called on the government to include Bitcoin in its diversified reserves, alongside gold and foreign exchange reserves. He said Bitcoin has hedging properties and will help improve the resilience and adaptability of Taiwan's financial system.…</p>— Wu Blockchain (@WuBlockchain) <a href=\"https://twitter.com/WuBlockchain/status/1920782049713205646?ref_src=twsrc%5Etfw\">May 9, 2025</a></blockquote> </div></figure><p>Right now, Taiwan holds 423 metric tons of gold and around US$577 billion in foreign exchange reserves. But there’s a catch, over 90% of those reserves are invested in U.S. Treasury bonds.</p><p>Experts worry that if a major conflict or financial shock happens, these traditional assets might lose value or become hard to use quickly. These changes have raised questions about how secure the country’s financial reserves are.</p><h2 id=\"h-new-proposal-add-bitcoin-to-national-reserves\">New Proposal: Add Bitcoin to National Reserves</h2><p>To address this issue, <a href=\"https://www.youtube.com/watch?v=wOCXYY-qJbE\">in a recent parliamentary session</a>, Taiwan legislator Ko Ju-Chun has suggested that the government should consider adding Bitcoin to Taiwan’s national asset reserves.</p><p>He believes Bitcoin can act as a hedge against inflation and global risks. Because Bitcoin has a fixed supply of 21 million coins, is decentralized, and is harder to control or block, Ko says it can offer Taiwan more protection in uncertain times.</p><p>He’s not asking to replace gold or U.S. dollars, but simply to add a small portion of Bitcoin to the reserves, to give Taiwan more flexibility in the future.</p><h2 id=\"h-growing-support-for-bitcoin-s-initiative-nbsp\">Growing Support For Bitcoin’s Initiative&nbsp;</h2><p>Ko’s idea has received support from key figures like Former Premier Chen Cong recently said that Bitcoin may not be used like everyday money, but it is still a powerful asset to guard against inflation.</p><p>At the same time, Professor Liu Yiru from National Taiwan University pointed out that Bitcoin’s limited supply makes it different from traditional currencies, which can be printed in large amounts during crises.</p><h2 id=\"h-other-countries-are-taking-action-too\">Other Countries Are Taking Action Too</h2><p>Taiwan isn’t alone in this thinking. In the United States, the state of <a href=\"https://x.com/KellyAyotte/status/1919783147463426283\">New Hampshire just passed</a> the Bitcoin Reserve Act, officially allowing Bitcoin to be part of its state financial reserves. Other regions are also exploring similar steps as they try to prepare for future risks.</p></div><!-- .entry-content /--><!-- .toggle-post-content -->  <!-- .share-buttons /-->  </article><!-- #the-post /--><div><h2>We'd Love to Hear Your Thoughts on This Article!</h2><div><h4>Was this writing helpful?</h4></div></div>   <!-- .post-components /--></div></div>",
      "image": "http://image.coinpedia.org/wp-content/uploads/2024/05/09173932/Taiwan-Introduces-4-New-Laws-to-Combat-Fraud-Dealing-with-Virtual-Asset-and-AML.webp",
      "summary": "Taiwan lawmakers are urging Bitcoin as digital gold to help protect the nation's economy from inflation and global risks, joining other countries in adding alternative assets to their financial reserves."
    },
    {
      "original": "https://cryptopanic.com/news/21681327/Ethereum-Explodes-25-Higher-To-2400-Notches-Largest-1-Day-Gain-In-4-Years?mtm_campaign=API-OFA",
      "resolved": "https://www.benzinga.com/markets/cryptocurrency/25/05/45314930/ethereum-explodes-higher-largest-gain-in-four-years?utm_source=cryptopanic.com&utm_campaign=partner_feed&utm_medium=partner_feed&utm_content=site",
      "title": "Ethereum Blasts Off: 25% Leap To $2,400 As Pectra Upgrade Ignites Optimism Among Bulls",
      "content": "<div id=\"readability-page-1\" class=\"page\"><div><!--$--><p><strong>Ethereum </strong><span data-ticker=\"ETH/USD\" data-exchange=\"CRYPTO\">ETH/USD</span>, the world’s second-largest cryptocurrency by market capitalization, has soared 20% within 24 hours following the successful deployment of its <a href=\"https://www.benzinga.com/content/45294226/ethereum-price-surges-after-pectra-upgrade-bulls-now-eye-10-000-target\" target=\"_blank\">Pectra upgrade on May 7</a>.</p><!--/$--><!--$--><p><strong>What Happened: </strong>This surge, the largest single-day gain for ETH in four years, has reignited optimism among investors and developers, positioning Ethereum for a potential price breakout.</p><!--/$--><!--$--><p>The Pectra upgrade, described as the most significant overhaul since the 2022 Merge, introduces a suite of improvements aimed at enhancing scalability, user experience and staking efficiency.</p><!--/$--><!--$--><!--$--><!--/$--><!--/$--><!--$--><p>As the crypto community buzzes with excitement, analysts are dissecting whether this milestone could propel ETH past the $2,000 mark for the first time since March 2025.</p><!--/$--><!--$--><p>Speaking with Benzinga, <strong>Peter Chung</strong>&nbsp;of&nbsp;<strong>Presto Labs</strong> said despite the price move, as the macro worries continue to subside on the back of the positive tariff-related headlines, investors are willing to move further up on the risk curve to higher beta asset beyond Bitcoin, especially given alts huge underperformance so far.</p><!--/$--><!--$--><p>Moreover, he added that the series of announcement last night on tokenization, like <strong>Robinhood</strong>‘s <span data-ticker=\"HOOD\" data-exchange=\"NASDAQ\">HOOD</span> putting U.S. stocks on blockchain, <strong>Supperstate </strong>launching ‘Open Bell’, bode well for Ethereum, which is the most popular based layer for the tokenization.</p><!--/$--><!--$--><p><strong>The Pectra Upgrade: A Game-Changer For Ethereum</strong></p><!--/$--><!--$--><!--/$--><!--$--><p>Activated on May 7, 2025, at 10:05 AM UTC, the Pectra upgrade represents Ethereum's 16th major network update since its inception in 2015. </p><!--/$--><!--$--><p>Combining the Prague execution layer and Electra consensus layer upgrades, Pectra integrates 11 Ethereum Improvement Proposals (EIPs), making it the largest hard fork in the blockchain's history. </p><!--/$--><!--$--><p><a href=\"https://coinjournal.net/news/ethereum-eth-sees-major-uptick-as-pectra-upgrade-goes-live/\" target=\"_blank\">According</a> to <strong>Tim Beiko</strong>, who oversees Ethereum's core protocol meetings, Pectra is second only to the Merge in its transformative potential, redefining staking economics and validator efficiency across the ecosystem.</p><!--/$--><!--$--><!--/$--><!--$--><p>Among the standout features is EIP-7702, which introduces account abstraction, allowing externally owned accounts (EOAs) to function like smart contracts within a single transaction. </p><!--/$--><!--$--><p>This enables users to pay transaction fees with tokens other than ETH and enhances wallet functionality, making Ethereum more user-friendly. </p><!--/$--><!--$--><p><strong>Ivo Georgiev</strong>, CEO of <strong>Ambire</strong>, a self-custodial smart wallet, <a href=\"https://cointelegraph.com/news/lockbit-ransomware-breach-bitcoin-addresses-leaked\" target=\"_blank\">called </a>EIP-7702 \"the single greatest UX upgrade to Ethereum so far,\" noting that wallets like Ambire and Trust Wallet have already adopted these features.</p><!--/$--><!--$--><p>Another key change is EIP-7251, which raises the staking limit for validators from 32 ETH to 2,048 ETH—a 64-fold increase. </p><!--/$--><!--$--><!--$--><!--/$--><!--/$--><!--$--><p>This adjustment streamlines staking operations for both individual and institutional validators, reducing operational complexity and encouraging greater participation in Ethereum's proof-of-stake system. </p><!--/$--><!--$--><p>Additionally, Pectra doubles the number of data \"blobs\" Ethereum can handle, building on the Dencun upgrade of March 2024 to keep transaction fees on Layer 2 (L2) blockchains affordable. </p><!--/$--><!--$--><p>These enhancements aim to bolster Ethereum's scalability, particularly for rollups, which are critical to the network's Layer 2 ecosystem.</p><!--/$--><!--$--><!--$--><!--/$--><!--/$--><!--$--><p>Despite a rocky development journey, including failed testnet deployments on Holesky and Sepolia due to configuration issues, the successful Hoodi testnet in March 2025 paved the way for Pectra's mainnet launch. </p><!--/$--><!--$--><p>Ethereum Foundation researcher <strong>Justin Drake</strong> <a href=\"https://cryptoslate.com/post-pectra-ethereum-now-targets-efficiency-with-60-million-gas-limit-expansion/\" target=\"_blank\">confirmed</a> that validators are already configured for post-Pectra efficiency measures, such as a 60 million gas limit expansion to boost transaction throughput.</p><!--/$--><!--$--><p><strong>Also Read: <a href=\"https://www.benzinga.com/markets/cryptocurrency/25/05/45138065/uae-sets-global-benchmark-for-crypto-banking-integration-amina-banks-rohan-misra-says\" target=\"_blank\">UAE Sets Global Benchmark For Crypto-Banking Integration, Amina Bank’s Rohan Misra Says</a></strong></p><!--/$--><!--$--><p><strong>Market Impact And Investor Sentiment</strong></p><!--/$--><!--$--><p>The market's response to Pectra was swift and decisive. ETH's price, which had been trading around $1,830 before the upgrade, surged to over $2,400 on Friday morning, recording the strongest single-day increase since 2021 on Thursday.</p><!--/$--><!--$--><p>Trading volumes spiked by nearly 46%, driven by heightened activity in the Ethereum Virtual Machine (EVM), which Pectra has made faster, cheaper, and more scalable. </p><!--/$--><!--$--><!--/$--><!--$--><p>The upgrade also triggered a surge in network activity, reducing ETH's circulating supply to an 18-day low of 120.69 million ETH, creating upward price pressure.</p><!--/$--><!--$--><p>Analysts attribute the rally to renewed confidence in Ethereum's technical roadmap. </p><!--/$--><!--$--><p>Posts on microblogging site <strong>X</strong> echoed this sentiment, with users highlighting Pectra's potential to unlock mass adoption through faster transactions, lower gas fees, and improved scalability. </p><!--/$--><!--$--><p>However, some market watchers remain cautious, noting that ETH futures premiums remained flat at 3% post-upgrade, signaling a lack of aggressive bullish bets from leveraged traders. </p><!--/$--><!--$--><p>Additionally, Ethereum-based ETFs have <a href=\"https://sosovalue.com/assets/etf/us-eth-spot\" target=\"_blank\">seen</a> $16.11 million in net outflows since January 2025, reflecting institutional hesitation.</p><!--/$--><!--$--><p><strong>Ethereum's Upgrade Legacy</strong></p><!--/$--><!--$--><p>Pectra builds on a decade of Ethereum upgrades, each addressing critical limitations. </p><!--/$--><!--$--><p>The 2022 Merge transitioned Ethereum from energy-intensive proof-of-work to proof-of-stake, slashing its carbon footprint by 99.95%. </p><!--/$--><!--$--><p>The 2024 Dencun upgrade reduced Layer 2 transaction costs, making rollups more viable for decentralized applications (DApps). </p><!--/$--><!--$--><p>Since its launch, Ethereum has undergone approximately 20 major upgrades, with Pectra marking a continuation of its commitment to scalability, security, and decentralization.</p><!--/$--><!--$--><p>However, Pectra's immediate impact on DApp interoperability remains limited. </p><!--/$--><!--$--><p>Unlike <strong>Solana </strong><span data-ticker=\"SOL/USD\" data-exchange=\"CRYPTO\">SOL/USD</span> or <strong>BNB Chain </strong><span data-ticker=\"BNB/USD\" data-exchange=\"CRYPTO\">BNB/USD</span>, Ethereum's Layer 2 ecosystem still faces challenges in seamless asset and data bridging, which may explain why ETH has struggled to reclaim its March 2025 high of $2,200. </p><!--/$--><!--$--><p>Analysts suggest that a surge in DApp and network activity could drive further price recovery, potentially pushing ETH toward $3,000 if bullish momentum persists.</p><!--/$--><!--$--><p><strong>What Lies Ahead</strong></p><!--/$--><!--$--><p>As Ethereum charts its path forward, Pectra sets the stage for future upgrades like Fusaka, which will further refine Layer 2 and Layer 3 scalability. </p><!--/$--><!--$--><p>The upgrade has already spurred staking activity, with 627,000 ETH staked since mid-February 2025, reversing a pre-Pectra decline. </p><!--/$--><!--$--><p>Companies like <strong>BTCS Inc.</strong> are leveraging Pectra to roll out initiatives like the Staker Protection Plan, aimed at improving transaction inclusion and regulatory compliance.</p><!--/$--><!--$--><p>While Pectra's technical achievements are undeniable, its long-term impact hinges on market adoption and developer innovation. </p><!--/$--><!--$--><p>For now, Ethereum's 20% surge underscores the market's faith in its evolution as the leading smart contract platform. </p><!--/$--><!--$--><p>As one X user put it, \"Pectra is where Ethereum starts feeling like a modern network\". </p><!--/$--><!--$--><p>Whether this upgrade marks ETH's breakout moment remains to be seen, but for the first time in years, Ethereum is back in the spotlight.</p><!--/$--><!--$--><!--/$--><!--$--><p><strong>Read Next: </strong></p><!--/$--><!--$--><ul>\n<li><strong><a href=\"https://www.benzinga.com/markets/cryptocurrency/25/05/45297511/98-of-pump-fun-tokens-are-frauds-the-extractive-nature-of-solana-meme-coins\" target=\"_blank\">98% Of Pump.fun Tokens Are Frauds: The Extractive Nature Of Solana Meme Coins</a></strong></li>\n</ul><!--/$--><!--$--><p><em>Image: Shutterstock</em></p><!--/$--></div><p>© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p></div>",
      "image": null,
      "summary": "Ethereum, the world's second-largest cryptocurrency by market cap, surged 20% in a single day after its major Pectra upgrade went live on May 7, reigniting optimism and positioning it for a potential price breakout."
    }
  ],
  "sentiment": {
    "value": "73",
    "label": "🤑 Ape Season",
    "description": "Twitter threads promising 1000x. Your grandma's buying altcoins."
  },
  "topMessage": {
    "text": "It was quite a week for crypto! Bitcoin finally broke through that elusive $100K barrier and the altcoins followed suit - literally. As we speak, the shorts are getting smoked and people who were betting against the market are probably scrambling to cover their positions like rats on a sinking ship.<br /><br />Meanwhile, some crypto whales decided they wanted in on the Pi action and dropped a cool 14 million coins into the pool, worth $14 million. This kind of buying activity doesn't necessarily mean it's going up, but it does suggest that someone thinks there might be a supply crunch coming - which is never good for sellers.<br /><br />On the regulatory front (ha!), the US Senate couldn't agree on any crypto legislation, so that'll just have to wait for another day. Over in Germany, the authorities had enough of eXch's shenanigans and shut it down for allegedly laundering North Korean stolen assets. And then there was the PiCoin drama - Jeffy Yu faked his own death during a livestream and his meme coin skyrocketed before crashing (nice try, pal).<br /><br />Stripe wants to make life easier for businesses with stablecoin accounts. It's like they said: 'we're going to bridge the gap between crypto and traditional finance.' Yawn.<br /><br />Oh, and Taiwan is just joining the party by adding Bitcoin as digital gold to their financial reserves - because who wouldn't want that right?<br /><br />Ethereum also got a nice upgrade and surged 20% in one day. <br /><br />More details on all this below:",
    "keyTerms": [
      {
        "term": "Bitcoin surges to $103K",
        "articleIndex": 0
      },
      {
        "term": "Crypto whales buy 14 million Pi Coins",
        "articleIndex": 3
      },
      {
        "term": "Taiwan adds Bitcoin as digital gold to financial reserves",
        "articleIndex": 8
      }
    ]
  },
  "gainers": [
    {
      "name": "Entangle",
      "symbol": "NTGL",
      "price": "0.00",
      "change": "273.57",
      "icon": "https://coin-images.coingecko.com/coins/images/34522/large/Logo_-_Icon_Square.png?1733260911",
      "link": "https://www.coingecko.com/en/coins/entangle"
    },
    {
      "name": "Moo Deng",
      "symbol": "MOODENG",
      "price": "0.12",
      "change": "150.10",
      "icon": "https://coin-images.coingecko.com/coins/images/50264/large/MOODENG.jpg?1726726975",
      "link": "https://www.coingecko.com/en/coins/moo-deng"
    },
    {
      "name": "Peanut the Squirrel",
      "symbol": "PNUT",
      "price": "0.27",
      "change": "53.75",
      "icon": "https://coin-images.coingecko.com/coins/images/51301/large/Peanut_the_Squirrel.png?1734941241",
      "link": "https://www.coingecko.com/en/coins/peanut-the-squirrel"
    },
    {
      "name": "Neiro",
      "symbol": "NEIRO",
      "price": "0.00",
      "change": "35.07",
      "icon": "https://coin-images.coingecko.com/coins/images/39488/large/neiro.jpg?1731449567",
      "link": "https://www.coingecko.com/en/coins/neiro-3"
    },
    {
      "name": "Pepe",
      "symbol": "PEPE",
      "price": "0.00",
      "change": "34.80",
      "icon": "https://coin-images.coingecko.com/coins/images/29850/large/pepe-token.jpeg?1696528776",
      "link": "https://www.coingecko.com/en/coins/pepe"
    }
  ],
  "losers": [
    {
      "name": "Ozone Chain",
      "symbol": "OZO",
      "price": "0.12",
      "change": "-21.20",
      "icon": "https://coin-images.coingecko.com/coins/images/31385/large/ozonechain-momogram-200x200.png?1696530201",
      "link": "https://www.coingecko.com/en/coins/ozone-chain"
    },
    {
      "name": "Safe",
      "symbol": "SAFE",
      "price": "0.53",
      "change": "-11.43",
      "icon": "https://coin-images.coingecko.com/coins/images/27032/large/Artboard_1_copy_8circle-1.png?1696526084",
      "link": "https://www.coingecko.com/en/coins/safe"
    },
    {
      "name": "AI Companions",
      "symbol": "AIC",
      "price": "0.17",
      "change": "-7.90",
      "icon": "https://coin-images.coingecko.com/coins/images/40130/large/AI_Companions.png?1725942702",
      "link": "https://www.coingecko.com/en/coins/ai-companions"
    },
    {
      "name": "Solayer",
      "symbol": "LAYER",
      "price": "1.20",
      "change": "-6.19",
      "icon": "https://coin-images.coingecko.com/coins/images/53498/large/Layer_Green.png?1744950002",
      "link": "https://www.coingecko.com/en/coins/solayer"
    },
    {
      "name": "Constellation",
      "symbol": "DAG",
      "price": "0.04",
      "change": "-4.80",
      "icon": "https://coin-images.coingecko.com/coins/images/4645/large/Constellation_Network_Logo.png?1696505213",
      "link": "https://www.coingecko.com/en/coins/constellation-labs"
    }
  ],
  "wtfExplainer": "EGGT is the token that thinks it can turn movie memorabilia into NFTs and make a mint in the metaverse. It's got its own little ecosystem with tokens like EGGTFi (get it?) to keep liquidity from evaporating faster than an egg in a microwave. XNOTI, the dev behind this operation, has been running discount ticket platforms for movies for over a decade, because who needs to make art when you can just resell movie stubs? Now they're trying their hand at NFTs, because apparently they thought \"Egg\" was a good idea for a coin name.",
  "weirdCoin": {
    "name": "Egg N Partners",
    "symbol": "EGGT",
    "id": "egg-n-partners",
    "icon": "https://coin-images.coingecko.com/coins/images/27418/large/kKDBrCqb_400x400.jpeg?1696526459",
    "link": "https://www.coingecko.com/en/coins/egg-n-partners"
  },
  "snarkyWisdom": "\"The most valuable lesson I've learned from getting rekt is that 'strong hands' are just code for people who can hold losses better than you, not smart enough to sell before they happened.\"",
  "redditresults": [
    {
      "subreddit": "CryptoCurrency",
      "title": "We Are So Back!",
      "url": "https://reddit.com/r/CryptoCurrency/comments/1khvjfz/we_are_so_back/",
      "score": 1697,
      "upvote_ratio": 0.95,
      "nsfw": false,
      "author": "kirtash93"
    },
    {
      "subreddit": "defi",
      "title": "Bitcoin Yield Demand Booming as Institutions Seek Liquidity Says Solv CEO",
      "url": "https://reddit.com/r/defi/comments/1khrqyn/bitcoin_yield_demand_booming_as_institutions_seek/",
      "score": 29,
      "upvote_ratio": 0.98,
      "nsfw": false,
      "author": "ProfitableCheetah"
    },
    {
      "subreddit": "CryptoMarkets",
      "title": "Last chance to buy Eth",
      "url": "https://reddit.com/r/CryptoMarkets/comments/1ki0p0n/last_chance_to_buy_eth/",
      "score": 71,
      "upvote_ratio": 0.67,
      "nsfw": false,
      "author": "Reg_doge_dwight"
    },
    {
      "subreddit": "CryptoMoonShots",
      "title": "How i improved my crypto trades using a sniping bot",
      "url": "https://reddit.com/r/CryptoMoonShots/comments/1ki1155/how_i_improved_my_crypto_trades_using_a_sniping/",
      "score": 939,
      "upvote_ratio": 1,
      "nsfw": false,
      "author": "Beginning_Service387"
    }
  ],
  "cryptomeme": {
    "title": "Buttcoiners watching Bitcoin green candle beyond $100,000",
    "image": "https://i.redd.it/xtjjh8egtmze1.gif",
    "permalink": "https://reddit.com/r/cryptocurrencymemes/comments/1ki2qv8/buttcoiners_watching_bitcoin_green_candle_beyond/"
  },
  "greeting": "Fellow Degen,\nIf you woke up wondering whether your bags are blessed or cursed, you're in the right inbox. Let's break it down."
}